--
--  This is a generated file.
--  DO NOT EDIT.
--

separate (ZanyBlue.Text.Locales)
function String_Addresses return String_Addresses_Type is

   Result : constant String_Addresses_Type :=
     (
      --  1: ""
   1 => (First => 1, Last => 0),
      --  2: "൦൧൨൩൪൫൬൭൮൯"
   2 => (First => 1, Last => 10),
      --  3: "༠༡༢༣༤༥༦༧༨༩"

      3 => (First => 11, Last => 20),
      --  4: "꤀꤁꤂꤃꤄꤅꤆꤇꤈꤉"

4 => (First => 21, Last => 30),
      --  5: "௦௧௨௩௪௫௬௭௮௯"

      5 => (First => 31, Last => 40),
      --  6: "꩐꩑꩒꩓꩔꩕꩖꩗꩘꩙"
   6 => (First => 41, Last => 50),
      --  7: "᪐᪑᪒᪓᪔᪕᪖᪗᪘᪙"

      7 => (First => 51, Last => 60),
      --  8: "০১২৩৪৫৬৭৮৯"
   8 => (First => 61, Last => 70),
      --  9: "᥆᥇᥈᥉᥊᥋᥌᥍᥎᥏"

      9 => (First => 71, Last => 80),
      --  10: "꯰꯱꯲꯳꯴꯵꯶꯷꯸꯹"

10 => (First => 81, Last => 90),
      --  11: "೦೧೨೩೪೫೬೭೮೯"

      11 => (First => 91, Last => 100),
      --  12: "꧐꧑꧒꧓꧔꧕꧖꧗꧘꧙"
   12 => (First => 101, Last => 110),
      --  13: "੦੧੨੩੪੫੬੭੮੯"

      13 => (First => 111, Last => 120),
      --  14: "୦୧୨୩୪୫୬୭୮୯"
   14 => (First => 121, Last => 130),
      --  15: "໐໑໒໓໔໕໖໗໘໙"

      15 => (First => 131, Last => 140),
      --  16: "០១២៣៤៥៦៧៨៩"

16 => (First => 141, Last => 150),
      --  17: "᮰᮱᮲᮳᮴᮵᮶᮷᮸᮹"

      17 => (First => 151, Last => 160),
      --  18: "0123456789"
   18 => (First => 161, Last => 170),
      --  19: "᭐᭑᭒᭓᭔᭕᭖᭗᭘᭙"

      19 => (First => 171, Last => 180),
      --  20: "꣐꣑꣒꣓꣔꣕꣖꣗꣘꣙"
   20 => (First => 181, Last => 190),
      --  21: "૦૧૨૩૪૫૬૭૮૯"

      21 => (First => 191, Last => 200),
      --  22: "꘠꘡꘢꘣꘤꘥꘦꘧꘨꘩"

22 => (First => 201, Last => 210),
      --  23: "٠١٢٣٤٥٦٧٨٩"

      23 => (First => 211, Last => 220),
      --  24: "౦౧౨౩౪౫౬౭౮౯"
   24 => (First => 221, Last => 230),
      --  25: "๐๑๒๓๔๕๖๗๘๙"

      25 => (First => 231, Last => 240),
      --  26: "߀߁߂߃߄߅߆߇߈߉"
   26 => (First => 241, Last => 250),
      --  27: "᱀᱁᱂᱃᱄᱅᱆᱇᱈᱉"

      27 => (First => 251, Last => 260),
      --  28: "᧐᧑᧒᧓᧔᧕᧖᧗᧘᧙"

28 => (First => 261, Last => 270),
      --  29: "᠐᠑᠒᠓᠔᠕᠖᠗᠘᠙"

      29 => (First => 271, Last => 280),
      --  30: "०१२३४५६७८९"
   30 => (First => 281, Last => 290),
      --  31: "႐႑႒႓႔႕႖႗႘႙"

      31 => (First => 291, Last => 300),
      --  32: "᪀᪁᪂᪃᪄᪅᪆᪇᪈᪉"
   32 => (First => 301, Last => 310),
      --  33: "۰۱۲۳۴۵۶۷۸۹"

      33 => (First => 311, Last => 320),
      --  34: "᱐᱑᱒᱓᱔᱕᱖᱗᱘᱙"

34 => (First => 321, Last => 330),
      --  35: "〇一二三四五六七八九"

      35 => (First => 331, Last => 340),
      --  36: "၀၁၂၃၄၅၆၇၈၉"
   36 => (First => 341, Last => 350),
      --  37: "０１２３４５６７８９"

      37 => (First => 351, Last => 360),
      --  38: "화요일"
   38 => (First => 361, Last => 363),
      --  39: "화"

      39 => (First => 361, Last => 361),
      --  40: "토요일"

40 => (First => 364, Last => 366),
      --  41: "토"

      41 => (First => 364, Last => 364),
      --  42: "정오"
   42 => (First => 367, Last => 368),
      --  43: "일요일"

      43 => (First => 369, Last => 371),
      --  44: "일"
   44 => (First => 363, Last => 363),
      --  45: "월요일"

      45 => (First => 372, Last => 374),
      --  46: "월"

46 => (First => 372, Last => 372),
      --  47: "오후"

      47 => (First => 375, Last => 376),
      --  48: "오전"
   48 => (First => 377, Last => 378),
      --  49: "수요일"

      49 => (First => 379, Last => 381),
      --  50: "수"
   50 => (First => 379, Last => 379),
      --  51: "서기"

      51 => (First => 382, Last => 383),
      --  52: "목요일"

52 => (First => 384, Last => 386),
      --  53: "목"

      53 => (First => 384, Last => 384),
      --  54: "기원전"
   54 => (First => 387, Last => 389),
      --  55: "금요일"

      55 => (First => 390, Last => 392),
      --  56: "금"
   56 => (First => 390, Last => 390),
      --  57: "非數值"

      57 => (First => 393, Last => 395),
      --  58: "金曜日"

58 => (First => 396, Last => 398),
      --  59: "金"

      59 => (First => 396, Last => 396),
      --  60: "週日"
   60 => (First => 399, Last => 400),
      --  61: "週四"

      61 => (First => 401, Last => 402),
      --  62: "週六"
   62 => (First => 403, Last => 404),
      --  63: "週五"

      63 => (First => 405, Last => 406),
      --  64: "週二"

64 => (First => 407, Last => 408),
      --  65: "週三"

      65 => (First => 409, Last => 410),
      --  66: "週一"
   66 => (First => 411, Last => 412),
      --  67: "西暦"

      67 => (First => 413, Last => 414),
      --  68: "西元前"
   68 => (First => 415, Last => 417),
      --  69: "西元"

      69 => (First => 415, Last => 416),
      --  70: "紀元前"

70 => (First => 418, Last => 420),
      --  71: "火曜日"

      71 => (First => 421, Last => 423),
      --  72: "火"
   72 => (First => 421, Last => 421),
      --  73: "清晨"

      73 => (First => 424, Last => 425),
      --  74: "水曜日"
   74 => (First => 426, Last => 428),
      --  75: "水"

      75 => (First => 426, Last => 426),
      --  76: "正午"

76 => (First => 429, Last => 430),
      --  77: "木曜日"

      77 => (First => 431, Last => 433),
      --  78: "木"
   78 => (First => 431, Last => 431),
      --  79: "月曜日"

      79 => (First => 434, Last => 436),
      --  80: "月"
   80 => (First => 434, Last => 434),
      --  81: "晚上"

      81 => (First => 437, Last => 438),
      --  82: "星期日"

82 => (First => 439, Last => 441),
      --  83: "星期四"

      83 => (First => 442, Last => 444),
      --  84: "星期六"
   84 => (First => 445, Last => 447),
      --  85: "星期五"

      85 => (First => 448, Last => 450),
      --  86: "星期二"
   86 => (First => 451, Last => 453),
      --  87: "星期三"

      87 => (First => 454, Last => 456),
      --  88: "星期一"

88 => (First => 457, Last => 459),
      --  89: "日曜日"

      89 => (First => 460, Last => 462),
      --  90: "日"
   90 => (First => 398, Last => 398),
      --  91: "土曜日"

      91 => (First => 463, Last => 465),
      --  92: "土"
   92 => (First => 463, Last => 463),
      --  93: "四月"

      93 => (First => 466, Last => 467),
      --  94: "周日"

94 => (First => 468, Last => 469),
      --  95: "周四"

      95 => (First => 470, Last => 471),
      --  96: "周六"
   96 => (First => 472, Last => 473),
      --  97: "周五"

      97 => (First => 474, Last => 475),
      --  98: "周二"
   98 => (First => 476, Last => 477),
      --  99: "周三"

      99 => (First => 478, Last => 479),
      --  100: "周一"

100 => (First => 480, Last => 481),
      --  101: "午後"

      101 => (First => 482, Last => 483),
      --  102: "午前"
   102 => (First => 484, Last => 485),
      --  103: "十月"

      103 => (First => 486, Last => 487),
      --  104: "十二月"
   104 => (First => 488, Last => 490),
      --  105: "十一月"

      105 => (First => 491, Last => 493),
      --  106: "凌晨"

106 => (First => 494, Last => 495),
      --  107: "六月"

      107 => (First => 496, Last => 497),
      --  108: "公元前"
   108 => (First => 498, Last => 500),
      --  109: "公元"

      109 => (First => 498, Last => 499),
      --  110: "八月"
   110 => (First => 501, Last => 502),
      --  111: "五月"

      111 => (First => 503, Last => 504),
      --  112: "二月"

112 => (First => 489, Last => 490),
      --  113: "九月"

      113 => (First => 505, Last => 506),
      --  114: "中午"
   114 => (First => 507, Last => 508),
      --  115: "下午"

      115 => (First => 509, Last => 510),
      --  116: "上午"
   116 => (First => 511, Last => 512),
      --  117: "三月"

      117 => (First => 513, Last => 514),
      --  118: "七月"

118 => (First => 515, Last => 516),
      --  119: "一月"

      119 => (First => 492, Last => 493),
      --  120: "∞"
   120 => (First => 517, Last => 517),
      --  121: "−"

      121 => (First => 518, Last => 518),
      --  122: "‰"
   122 => (First => 519, Last => 519),
      --  123: "‎-"

      123 => (First => 520, Last => 521),
      --  124: "‎+"

124 => (First => 522, Last => 523),
      --  125: "เมษายน"

      125 => (First => 524, Last => 529),
      --  126: "เม.ย."
   126 => (First => 530, Last => 534),
      --  127: "เที่ยง"

      127 => (First => 535, Last => 540),
      --  128: "อา."
   128 => (First => 541, Last => 543),
      --  129: "อ."

      129 => (First => 544, Last => 545),
      --  130: "หลังเที่ยง"

130 => (First => 546, Last => 555),
      --  131: "สิงหาคม"

      131 => (First => 556, Last => 562),
      --  132: "ส.ค."
   132 => (First => 563, Last => 566),
      --  133: "ส."

      133 => (First => 563, Last => 564),
      --  134: "ศ."
   134 => (First => 567, Last => 568),
      --  135: "วันเสาร์"

      135 => (First => 569, Last => 576),
      --  136: "วันอาทิตย์"

136 => (First => 577, Last => 586),
      --  137: "วันอังคาร"

      137 => (First => 587, Last => 595),
      --  138: "วันศุกร์"
   138 => (First => 596, Last => 603),
      --  139: "วันพุธ"

      139 => (First => 604, Last => 609),
      --  140: "วันพฤหัสบดี"
   140 => (First => 610, Last => 620),
      --  141: "วันจันทร์"

      141 => (First => 621, Last => 629),
      --  142: "มีนาคม"

142 => (First => 630, Last => 635),
      --  143: "มี.ค."

      143 => (First => 636, Last => 640),
      --  144: "มิถุนายน"
   144 => (First => 641, Last => 648),
      --  145: "มิ.ย."

      145 => (First => 649, Last => 653),
      --  146: "มกราคม"
   146 => (First => 654, Last => 659),
      --  147: "ม.ค."

      147 => (First => 660, Last => 663),
      --  148: "พฤษภาคม"

148 => (First => 664, Last => 670),
      --  149: "พฤศจิกายน"

      149 => (First => 671, Last => 679),
      --  150: "พฤ."
   150 => (First => 680, Last => 682),
      --  151: "พ.ย."

      151 => (First => 683, Last => 686),
      --  152: "พ.ค."
   152 => (First => 687, Last => 690),
      --  153: "พ."

      153 => (First => 683, Last => 684),
      --  154: "ปีก่อน ค.ศ."

154 => (First => 691, Last => 701),
      --  155: "ธันวาคม"

      155 => (First => 702, Last => 708),
      --  156: "ธ.ค."
   156 => (First => 709, Last => 712),
      --  157: "ตุลาคม"

      157 => (First => 713, Last => 718),
      --  158: "ต.ค."
   158 => (First => 719, Last => 722),
      --  159: "จ."

      159 => (First => 723, Last => 724),
      --  160: "ค.ศ."

160 => (First => 565, Last => 568),
      --  161: "ก่อนเที่ยง"

      161 => (First => 725, Last => 734),
      --  162: "กุมภาพันธ์"
   162 => (First => 735, Last => 744),
      --  163: "กันยายน"

      163 => (First => 745, Last => 751),
      --  164: "กรกฎาคม"
   164 => (First => 752, Last => 758),
      --  165: "ก.ย."

      165 => (First => 759, Last => 762),
      --  166: "ก.พ."

166 => (First => 763, Last => 766),
      --  167: "ก.ค."

      167 => (First => 767, Last => 770),
      --  168: "٠"
   168 => (First => 211, Last => 211),
      --  169: "يونيو"

      169 => (First => 771, Last => 775),
      --  170: "يوليو"
   170 => (First => 776, Last => 780),
      --  171: "يناير"

      171 => (First => 781, Last => 785),
      --  172: "ي"

172 => (First => 771, Last => 771),
      --  173: "و"

      173 => (First => 772, Last => 772),
      --  174: "نوفمبر"
   174 => (First => 786, Last => 791),
      --  175: "ن"

      175 => (First => 773, Last => 773),
      --  176: "مايو"
   176 => (First => 792, Last => 795),
      --  177: "مارس"

      177 => (First => 796, Last => 799),
      --  178: "م"

178 => (First => 789, Last => 789),
      --  179: "ل"

      179 => (First => 778, Last => 778),
      --  180: "ك"
   180 => (First => 800, Last => 800),
      --  181: "ق.م"

      181 => (First => 801, Last => 803),
      --  182: "فبراير"
   182 => (First => 804, Last => 809),
      --  183: "ف"

      183 => (First => 788, Last => 788),
      --  184: "غ"

184 => (First => 810, Last => 810),
      --  185: "ظ"

      185 => (First => 811, Last => 811),
      --  186: "ص"
   186 => (First => 812, Last => 812),
      --  187: "سبتمبر"

      187 => (First => 813, Last => 818),
      --  188: "س"
   188 => (First => 799, Last => 799),
      --  189: "ديسمبر"

      189 => (First => 819, Last => 824),
      --  190: "د"

190 => (First => 819, Last => 819),
      --  191: "ب"

      191 => (First => 790, Last => 790),
      --  192: "السبت"
   192 => (First => 825, Last => 829),
      --  193: "الخميس"

      193 => (First => 830, Last => 835),
      --  194: "الجمعة"
   194 => (First => 836, Last => 841),
      --  195: "الثلاثاء"

      195 => (First => 842, Last => 849),
      --  196: "الاثنين"

196 => (First => 850, Last => 856),
      --  197: "الأربعاء"

      197 => (First => 857, Last => 864),
      --  198: "الأحد"
   198 => (First => 865, Last => 869),
      --  199: "أكتوبر"

      199 => (First => 870, Last => 875),
      --  200: "أغسطس"
   200 => (First => 876, Last => 880),
      --  201: "أبريل"

      201 => (First => 881, Last => 885),
      --  202: "أ"

202 => (First => 859, Last => 859),
      --  203: "שבת"

      203 => (First => 886, Last => 888),
      --  204: "פבר׳"
   204 => (First => 889, Last => 892),
      --  205: "פברואר"

      205 => (First => 893, Last => 898),
      --  206: "ספט׳"
   206 => (First => 899, Last => 902),
      --  207: "ספטמבר"

      207 => (First => 903, Last => 908),
      --  208: "נוב׳"

208 => (First => 909, Last => 912),
      --  209: "נובמבר"

      209 => (First => 913, Last => 918),
      --  210: "מרץ"
   210 => (First => 919, Last => 921),
      --  211: "מאי"

      211 => (First => 922, Last => 924),
      --  212: "לפנה״צ"
   212 => (First => 925, Last => 930),
      --  213: "לפנה״ס"

      213 => (First => 931, Last => 936),
      --  214: "לספירה"

214 => (First => 937, Last => 942),
      --  215: "ינו׳"

      215 => (First => 943, Last => 946),
      --  216: "ינואר"
   216 => (First => 947, Last => 951),
      --  217: "יוני"

      217 => (First => 952, Last => 955),
      --  218: "יום שני"
   218 => (First => 956, Last => 962),
      --  219: "יום שלישי"

      219 => (First => 963, Last => 971),
      --  220: "יום שישי"

220 => (First => 972, Last => 979),
      --  221: "יום שבת"

      221 => (First => 980, Last => 986),
      --  222: "יום רביעי"
   222 => (First => 987, Last => 995),
      --  223: "יום ראשון"

      223 => (First => 996, Last => 1_004),
      --  224: "יום חמישי"

      224 => (First => 1_005, Last => 1_013),
      --  225: "יום ו׳"

      225 => (First => 1_014, Last => 1_019),
      --  226: "יום ה׳"

      226 => (First => 1_020, Last => 1_025),
      --  227: "יום ד׳"

      227 => (First => 1_026, Last => 1_031),
      --  228: "יום ג׳"

      228 => (First => 1_032, Last => 1_037),
      --  229: "יום ב׳"

      229 => (First => 1_038, Last => 1_043),
      --  230: "יום א׳"

      230 => (First => 1_044, Last => 1_049),
      --  231: "יולי"

      231 => (First => 1_050, Last => 1_053),
      --  232: "דצמ׳"

      232 => (First => 1_054, Last => 1_057),
      --  233: "דצמבר"

      233 => (First => 1_058, Last => 1_062),
      --  234: "בצהריים"

      234 => (First => 1_063, Last => 1_069),
      --  235: "אפר׳"

      235 => (First => 1_070, Last => 1_073),
      --  236: "אפריל"

      236 => (First => 1_074, Last => 1_078),
      --  237: "אחה״צ"

      237 => (First => 1_079, Last => 1_083),
      --  238: "אוק׳"

      238 => (First => 1_084, Last => 1_087),
      --  239: "אוקטובר"

      239 => (First => 1_088, Last => 1_094),
      --  240: "אוג׳"

      240 => (First => 1_095, Last => 1_098),
      --  241: "אוגוסט"

      241 => (First => 1_099, Last => 1_104),
      --  242: "января"

      242 => (First => 1_105, Last => 1_110),
      --  243: "янв."

      243 => (First => 1_111, Last => 1_114),
      --  244: "чт"

      244 => (First => 1_115, Last => 1_116),
      --  245: "четверг"

      245 => (First => 1_117, Last => 1_123),
      --  246: "февраля"

      246 => (First => 1_124, Last => 1_130),
      --  247: "февр."

      247 => (First => 1_131, Last => 1_135),
      --  248: "суббота"

      248 => (First => 1_136, Last => 1_142),
      --  249: "среда"

      249 => (First => 1_143, Last => 1_147),
      --  250: "ср"

      250 => (First => 1_143, Last => 1_144),
      --  251: "сентября"

      251 => (First => 1_148, Last => 1_155),
      --  252: "сент."

      252 => (First => 1_156, Last => 1_160),
      --  253: "сб"

      253 => (First => 1_161, Last => 1_162),
      --  254: "пятница"

      254 => (First => 1_163, Last => 1_169),
      --  255: "пт"

      255 => (First => 1_170, Last => 1_171),
      --  256: "понедельник"

      256 => (First => 1_172, Last => 1_182),
      --  257: "полдень"

      257 => (First => 1_183, Last => 1_189),
      --  258: "пн"

      258 => (First => 1_190, Last => 1_191),
      --  259: "октября"

      259 => (First => 1_192, Last => 1_198),
      --  260: "окт."

      260 => (First => 1_199, Last => 1_202),
      --  261: "ноября"

      261 => (First => 1_203, Last => 1_208),
      --  262: "нояб."

      262 => (First => 1_209, Last => 1_213),
      --  263: "не число"

      263 => (First => 1_214, Last => 1_221),
      --  264: "н. э."

      264 => (First => 1_222, Last => 1_226),
      --  265: "мая"

      265 => (First => 1_227, Last => 1_229),
      --  266: "марта"

      266 => (First => 1_230, Last => 1_234),
      --  267: "июня"

      267 => (First => 1_235, Last => 1_238),
      --  268: "июля"

      268 => (First => 1_239, Last => 1_242),
      --  269: "до н. э."

      269 => (First => 1_243, Last => 1_250),
      --  270: "декабря"

      270 => (First => 1_251, Last => 1_257),
      --  271: "дек."

      271 => (First => 1_258, Last => 1_261),
      --  272: "вторник"

      272 => (First => 1_262, Last => 1_268),
      --  273: "вт"

      273 => (First => 1_262, Last => 1_263),
      --  274: "вс"

      274 => (First => 1_269, Last => 1_270),
      --  275: "воскресенье"

      275 => (First => 1_271, Last => 1_281),
      --  276: "апреля"

      276 => (First => 1_282, Last => 1_287),
      --  277: "апр."

      277 => (First => 1_288, Last => 1_291),
      --  278: "августа"

      278 => (First => 1_292, Last => 1_298),
      --  279: "авг."

      279 => (First => 1_299, Last => 1_302),
      --  280: "Я"

      280 => (First => 1_303, Last => 1_303),
      --  281: "Ф"

      281 => (First => 1_304, Last => 1_304),
      --  282: "С"

      282 => (First => 1_305, Last => 1_305),
      --  283: "О"

      283 => (First => 1_306, Last => 1_306),
      --  284: "Н"

      284 => (First => 1_307, Last => 1_307),
      --  285: "М"

      285 => (First => 1_308, Last => 1_308),
      --  286: "И"

      286 => (First => 1_309, Last => 1_309),
      --  287: "Д"

      287 => (First => 1_310, Last => 1_310),
      --  288: "А"

      288 => (First => 1_311, Last => 1_311),
      --  289: "π.μ."

      289 => (First => 1_312, Last => 1_315),
      --  290: "π.Χ."

      290 => (First => 1_316, Last => 1_319),
      --  291: "μεσημέρι"

      291 => (First => 1_320, Last => 1_327),
      --  292: "μ.μ."

      292 => (First => 1_328, Last => 1_331),
      --  293: "μ.Χ."

      293 => (First => 1_332, Last => 1_335),
      --  294: "Φεβρουαρίου"

      294 => (First => 1_336, Last => 1_346),
      --  295: "Φεβ"

      295 => (First => 1_336, Last => 1_338),
      --  296: "Φ"

      296 => (First => 1_336, Last => 1_336),
      --  297: "Τρίτη"

      297 => (First => 1_347, Last => 1_351),
      --  298: "Τρί"

      298 => (First => 1_347, Last => 1_349),
      --  299: "Τετάρτη"

      299 => (First => 1_352, Last => 1_358),
      --  300: "Τετ"

      300 => (First => 1_352, Last => 1_354),
      --  301: "Σεπτεμβρίου"

      301 => (First => 1_359, Last => 1_369),
      --  302: "Σεπ"

      302 => (First => 1_359, Last => 1_361),
      --  303: "Σάββατο"

      303 => (First => 1_370, Last => 1_376),
      --  304: "Σάβ"

      304 => (First => 1_370, Last => 1_372),
      --  305: "Σ"

      305 => (First => 1_359, Last => 1_359),
      --  306: "Παρασκευή"

      306 => (First => 1_377, Last => 1_385),
      --  307: "Παρ"

      307 => (First => 1_377, Last => 1_379),
      --  308: "Πέμπτη"

      308 => (First => 1_386, Last => 1_391),
      --  309: "Πέμ"

      309 => (First => 1_386, Last => 1_388),
      --  310: "Οκτωβρίου"

      310 => (First => 1_392, Last => 1_400),
      --  311: "Οκτ"

      311 => (First => 1_392, Last => 1_394),
      --  312: "Ο"

      312 => (First => 1_392, Last => 1_392),
      --  313: "Νοεμβρίου"

      313 => (First => 1_401, Last => 1_409),
      --  314: "Νοε"

      314 => (First => 1_401, Last => 1_403),
      --  315: "Ν"

      315 => (First => 1_401, Last => 1_401),
      --  316: "Μαρτίου"

      316 => (First => 1_410, Last => 1_416),
      --  317: "Μαρ"

      317 => (First => 1_410, Last => 1_412),
      --  318: "Μαΐου"

      318 => (First => 1_417, Last => 1_421),
      --  319: "Μαΐ"

      319 => (First => 1_417, Last => 1_419),
      --  320: "Μ"

      320 => (First => 1_410, Last => 1_410),
      --  321: "Κυριακή"

      321 => (First => 1_422, Last => 1_428),
      --  322: "Κυρ"

      322 => (First => 1_422, Last => 1_424),
      --  323: "Ιουνίου"

      323 => (First => 1_429, Last => 1_435),
      --  324: "Ιουν"

      324 => (First => 1_429, Last => 1_432),
      --  325: "Ιουλίου"

      325 => (First => 1_436, Last => 1_442),
      --  326: "Ιουλ"

      326 => (First => 1_436, Last => 1_439),
      --  327: "Ιανουαρίου"

      327 => (First => 1_443, Last => 1_452),
      --  328: "Ιαν"

      328 => (First => 1_443, Last => 1_445),
      --  329: "Ι"

      329 => (First => 1_429, Last => 1_429),
      --  330: "Δευτέρα"

      330 => (First => 1_453, Last => 1_459),
      --  331: "Δευ"

      331 => (First => 1_453, Last => 1_455),
      --  332: "Δεκεμβρίου"

      332 => (First => 1_460, Last => 1_469),
      --  333: "Δεκ"

      333 => (First => 1_460, Last => 1_462),
      --  334: "Δ"

      334 => (First => 1_453, Last => 1_453),
      --  335: "Αυγούστου"

      335 => (First => 1_470, Last => 1_478),
      --  336: "Αυγ"

      336 => (First => 1_470, Last => 1_472),
      --  337: "Απριλίου"

      337 => (First => 1_479, Last => 1_486),
      --  338: "Απρ"

      338 => (First => 1_479, Last => 1_481),
      --  339: "Α"

      339 => (First => 1_470, Last => 1_470),
      --  340: "štvrtok"

      340 => (First => 1_487, Last => 1_493),
      --  341: "št"

      341 => (First => 1_487, Last => 1_488),
      --  342: "Şubat"

      342 => (First => 1_494, Last => 1_498),
      --  343: "Şub"

      343 => (First => 1_494, Last => 1_496),
      --  344: "Ş"

      344 => (First => 1_494, Last => 1_494),
      --  345: "środa"

      345 => (First => 1_499, Last => 1_503),
      --  346: "śr."

      346 => (First => 1_504, Last => 1_506),
      --  347: "října"

      347 => (First => 1_507, Last => 1_511),
      --  348: "říj"

      348 => (First => 1_507, Last => 1_509),
      --  349: "čvn"

      349 => (First => 1_512, Last => 1_514),
      --  350: "čvc"

      350 => (First => 1_515, Last => 1_517),
      --  351: "čtvrtek"

      351 => (First => 1_518, Last => 1_524),
      --  352: "čt"

      352 => (First => 1_518, Last => 1_519),
      --  353: "června"

      353 => (First => 1_525, Last => 1_530),
      --  354: "července"

      354 => (First => 1_531, Last => 1_538),
      --  355: "úterý"

      355 => (First => 1_539, Last => 1_543),
      --  356: "út"

      356 => (First => 1_539, Last => 1_540),
      --  357: "února"

      357 => (First => 1_544, Last => 1_548),
      --  358: "úno"

      358 => (First => 1_544, Last => 1_546),
      --  359: "öğle"

      359 => (First => 1_549, Last => 1_552),
      --  360: "î.Hr."

      360 => (First => 1_553, Last => 1_557),
      --  361: "április"

      361 => (First => 1_558, Last => 1_564),
      --  362: "ápr."

      362 => (First => 1_565, Last => 1_568),
      --  363: "×10^"

      363 => (First => 1_569, Last => 1_572),
      --  364: "ÖÖ"

      364 => (First => 1_573, Last => 1_574),
      --  365: "ÖS"

      365 => (First => 1_575, Last => 1_576),
      --  366: "Çarşamba"

      366 => (First => 1_577, Last => 1_584),
      --  367: "Çar"

      367 => (First => 1_577, Last => 1_579),
      --  368: "Á"

      368 => (First => 1_585, Last => 1_585),
      --  369: "¤¤¤"

      369 => (First => 1_586, Last => 1_588),
      --  370: "¤ #,##0.00;(¤ #,##0.00)"

      370 => (First => 1_589, Last => 1_611),
      --  371: "¤ #,##0.00"

      371 => (First => 1_589, Last => 1_598),
      --  372: "¤#,##0.00;(¤#,##0.00)"

      372 => (First => 1_612, Last => 1_632),
      --  373: " "

      373 => (First => 1_216, Last => 1_216),
      --  374: "{1}, {0}"

      374 => (First => 1_633, Last => 1_640),
      --  375: "{1} בשעה {0}"

      375 => (First => 1_641, Last => 1_652),
      --  376: "{1} {0}"

      376 => (First => 1_653, Last => 1_659),
      --  377: "{1} - {0}"

      377 => (First => 1_660, Last => 1_668),
      --  378: "{1} 'um' {0}"

      378 => (First => 1_669, Last => 1_680),
      --  379: "{1} 'kl.' {0}"

      379 => (First => 1_681, Last => 1_693),
      --  380: "{1} 'at' {0}"

      380 => (First => 1_694, Last => 1_705),
      --  381: "září"

      381 => (First => 1_706, Last => 1_709),
      --  382: "zář"

      382 => (First => 1_706, Last => 1_708),
      --  383: "zzzzah:mm:ss"

      383 => (First => 1_710, Last => 1_721),
      --  384: "zondag"

      384 => (First => 1_722, Last => 1_727),
      --  385: "zo"

      385 => (First => 1_722, Last => 1_723),
      --  386: "zh_Hant"

      386 => (First => 1_728, Last => 1_734),
      --  387: "zh"

      387 => (First => 1_728, Last => 1_729),
      --  388: "zaterdag"

      388 => (First => 1_735, Last => 1_742),
      --  389: "zah:mm:ss"

      389 => (First => 1_713, Last => 1_721),
      --  390: "za"

      390 => (First => 1_713, Last => 1_714),
      --  391: "y년 M월 d일 EEEE"

      391 => (First => 1_743, Last => 1_755),
      --  392: "y년 M월 d일"

      392 => (First => 1_743, Last => 1_750),
      --  393: "y年M月d日EEEE"

      393 => (First => 1_756, Last => 1_765),
      --  394: "y年M月d日 EEEE"

      394 => (First => 1_766, Last => 1_776),
      --  395: "y年M月d日"

      395 => (First => 1_756, Last => 1_761),
      --  396: "yy/M/d"

      396 => (First => 1_777, Last => 1_782),
      --  397: "yy. M. d."

      397 => (First => 1_783, Last => 1_791),
      --  398: "y/MM/dd"

      398 => (First => 1_792, Last => 1_798),
      --  399: "y/M/d"

      399 => (First => 1_778, Last => 1_782),
      --  400: "y. MMMM d., EEEE"

      400 => (First => 1_799, Last => 1_814),
      --  401: "y. MMMM d."

      401 => (First => 1_799, Last => 1_808),
      --  402: "y. MMM d."

      402 => (First => 1_815, Last => 1_823),
      --  403: "y. MM. dd."

      403 => (First => 1_824, Last => 1_833),
      --  404: "y. M. d."

      404 => (First => 1_784, Last => 1_791),
      --  405: "y-MM-dd"

      405 => (First => 1_834, Last => 1_840),
      --  406: "wtorek"

      406 => (First => 1_841, Last => 1_846),
      --  407: "wt."

      407 => (First => 1_847, Last => 1_849),
      --  408: "września"

      408 => (First => 1_850, Last => 1_857),
      --  409: "wrz"

      409 => (First => 1_850, Last => 1_852),
      --  410: "woensdag"

      410 => (First => 1_858, Last => 1_865),
      --  411: "wo"

      411 => (First => 1_858, Last => 1_859),
      --  412: "wieczorem"

      412 => (First => 1_866, Last => 1_874),
      --  413: "weeHours"

      413 => (First => 1_875, Last => 1_882),
      --  414: "w południe"

      414 => (First => 1_883, Last => 1_892),
      --  415: "w nocy"

      415 => (First => 1_893, Last => 1_898),
      --  416: "w"

      416 => (First => 1_841, Last => 1_841),
      --  417: "vrijdag"

      417 => (First => 1_899, Last => 1_905),
      --  418: "vr"

      418 => (First => 1_489, Last => 1_490),
      --  419: "vormittags"

      419 => (First => 1_906, Last => 1_915),
      --  420: "vorm."

      420 => (First => 1_916, Last => 1_920),
      --  421: "vineri"

      421 => (First => 1_921, Last => 1_926),
      --  422: "viernes"

      422 => (First => 1_927, Last => 1_933),
      --  423: "vie."

      423 => (First => 1_934, Last => 1_937),
      --  424: "venerdì"

      424 => (First => 1_938, Last => 1_944),
      --  425: "vendredi"

      425 => (First => 1_945, Last => 1_952),
      --  426: "ven."

      426 => (First => 1_953, Last => 1_956),
      --  427: "ven"

      427 => (First => 1_534, Last => 1_536),
      --  428: "vasárnap"

      428 => (First => 1_957, Last => 1_964),
      --  429: "v.Chr."

      429 => (First => 1_965, Last => 1_970),
      --  430: "v. Chr."

      430 => (First => 1_971, Last => 1_977),
      --  431: "utorok"

      431 => (First => 1_978, Last => 1_983),
      --  432: "ut"

      432 => (First => 1_978, Last => 1_979),
      --  433: "tr"

      433 => (First => 1_984, Last => 1_985),
      --  434: "toukokuuta"

      434 => (First => 1_986, Last => 1_995),
      --  435: "torstaina"

      435 => (First => 1_996, Last => 2_004),
      --  436: "torsdag"

      436 => (First => 2_005, Last => 2_011),
      --  437: "tors"

      437 => (First => 1_996, Last => 1_999),
      --  438: "tor."

      438 => (First => 2_012, Last => 2_015),
      --  439: "to"

      439 => (First => 1_491, Last => 1_492),
      --  440: "tisdag"

      440 => (First => 2_016, Last => 2_021),
      --  441: "tis"

      441 => (First => 2_016, Last => 2_018),
      --  442: "tirsdag"

      442 => (First => 2_022, Last => 2_028),
      --  443: "tir."

      443 => (First => 2_029, Last => 2_032),
      --  444: "tiistaina"

      444 => (First => 2_033, Last => 2_041),
      --  445: "ti"

      445 => (First => 2_016, Last => 2_017),
      --  446: "th"

      446 => (First => 2_042, Last => 2_043),
      --  447: "terça-feira"

      447 => (First => 2_044, Last => 2_054),
      --  448: "ter"

      448 => (First => 1_540, Last => 1_542),
      --  449: "tarde"

      449 => (First => 2_055, Last => 2_059),
      --  450: "tammikuuta"

      450 => (First => 2_060, Last => 2_069),
      --  451: "søndag"

      451 => (First => 2_070, Last => 2_075),
      --  452: "søn."

      452 => (First => 2_076, Last => 2_079),
      --  453: "söndag"

      453 => (First => 2_080, Last => 2_085),
      --  454: "sön"

      454 => (First => 2_080, Last => 2_082),
      --  455: "sâmbătă"

      455 => (First => 2_086, Last => 2_092),
      --  456: "sábado"

      456 => (First => 2_093, Last => 2_098),
      --  457: "sáb."

      457 => (First => 2_099, Last => 2_102),
      --  458: "sáb"

      458 => (First => 2_093, Last => 2_095),
      --  459: "szombat"

      459 => (First => 2_103, Last => 2_109),
      --  460: "szerda"

      460 => (First => 2_110, Last => 2_115),
      --  461: "szeptember"

      461 => (First => 2_116, Last => 2_125),
      --  462: "szept."

      462 => (First => 2_126, Last => 2_131),
      --  463: "syyskuuta"

      463 => (First => 2_132, Last => 2_140),
      --  464: "sv"

      464 => (First => 1_915, Last => 1_916),
      --  465: "sunnuntaina"

      465 => (First => 2_141, Last => 2_151),
      --  466: "su"

      466 => (First => 2_141, Last => 2_142),
      --  467: "středa"

      467 => (First => 2_152, Last => 2_157),
      --  468: "stycznia"

      468 => (First => 2_158, Last => 2_165),
      --  469: "sty"

      469 => (First => 2_158, Last => 2_160),
      --  470: "streda"

      470 => (First => 2_166, Last => 2_171),
      --  471: "st"

      471 => (First => 1_999, Last => 2_000),
      --  472: "srpna"

      472 => (First => 2_172, Last => 2_176),
      --  473: "srp"

      473 => (First => 2_172, Last => 2_174),
      --  474: "soir"

      474 => (First => 2_177, Last => 2_180),
      --  475: "sobota"

      475 => (First => 2_181, Last => 2_186),
      --  476: "sob."

      476 => (First => 2_187, Last => 2_190),
      --  477: "so"

      477 => (First => 2_177, Last => 2_178),
      --  478: "sk"

      478 => (First => 2_135, Last => 2_136),
      --  479: "sierpnia"

      479 => (First => 2_191, Last => 2_198),
      --  480: "sie"

      480 => (First => 2_191, Last => 2_193),
      --  481: "sexta-feira"

      481 => (First => 2_199, Last => 2_209),
      --  482: "sex"

      482 => (First => 2_199, Last => 2_201),
      --  483: "settembre"

      483 => (First => 2_210, Last => 2_218),
      --  484: "setembro"

      484 => (First => 2_219, Last => 2_226),
      --  485: "set"

      485 => (First => 2_210, Last => 2_212),
      --  486: "septiembre"

      486 => (First => 2_227, Last => 2_236),
      --  487: "septembrie"

      487 => (First => 2_237, Last => 2_246),
      --  488: "septembre"

      488 => (First => 2_247, Last => 2_255),
      --  489: "septembra"

      489 => (First => 2_256, Last => 2_264),
      --  490: "september"

      490 => (First => 2_265, Last => 2_273),
      --  491: "sept."

      491 => (First => 2_274, Last => 2_278),
      --  492: "sep."

      492 => (First => 2_279, Last => 2_282),
      --  493: "sep"

      493 => (First => 2_227, Last => 2_229),
      --  494: "segunda-feira"

      494 => (First => 2_283, Last => 2_295),
      --  495: "seg"

      495 => (First => 2_283, Last => 2_285),
      --  496: "samedi"

      496 => (First => 2_296, Last => 2_301),
      --  497: "sam."

      497 => (First => 2_302, Last => 2_305),
      --  498: "sabato"

      498 => (First => 2_306, Last => 2_311),
      --  499: "sab"

      499 => (First => 2_306, Last => 2_308),
      --  500: "s"

      500 => (First => 1_564, Last => 1_564),
      --  501: "ru"

      501 => (First => 2_312, Last => 2_313),
      --  502: "ro"

      502 => (First => 1_500, Last => 1_501),
      --  503: "right-to-left"

      503 => (First => 2_314, Last => 2_326),
      --  504: "rano"

      504 => (First => 2_327, Last => 2_330),
      --  505: "quinta-feira"

      505 => (First => 2_331, Last => 2_342),
      --  506: "qui"

      506 => (First => 2_331, Last => 2_333),
      --  507: "quarta-feira"

      507 => (First => 2_343, Last => 2_354),
      --  508: "qua"

      508 => (First => 2_343, Last => 2_345),
      --  509: "př. n. l."

      509 => (First => 2_355, Last => 2_363),
      --  510: "péntek"

      510 => (First => 2_364, Last => 2_369),
      --  511: "på dagen"

      511 => (First => 2_370, Last => 2_377),
      --  512: "pátek"

      512 => (First => 2_378, Last => 2_382),
      --  513: "pá"

      513 => (First => 2_378, Last => 2_379),
      --  514: "pt."

      514 => (First => 2_129, Last => 2_131),
      --  515: "pt"

      515 => (First => 2_119, Last => 2_120),
      --  516: "przed południem"

      516 => (First => 2_383, Last => 2_397),
      --  517: "prosince"

      517 => (First => 2_398, Last => 2_405),
      --  518: "pro"

      518 => (First => 2_398, Last => 2_400),
      --  519: "pred Kr."

      519 => (First => 2_406, Last => 2_413),
      --  520: "poniedziałek"

      520 => (First => 2_414, Last => 2_425),
      --  521: "pondělí"

      521 => (First => 2_426, Last => 2_432),
      --  522: "pondelok"

      522 => (First => 2_433, Last => 2_440),
      --  523: "pon."

      523 => (First => 2_441, Last => 2_444),
      --  524: "poludnie"

      524 => (First => 2_445, Last => 2_452),
      --  525: "poledne"

      525 => (First => 2_453, Last => 2_459),
      --  526: "po południu"

      526 => (First => 2_460, Last => 2_470),
      --  527: "po Kr."

      527 => (First => 2_471, Last => 2_476),
      --  528: "po"

      528 => (First => 1_885, Last => 1_886),
      --  529: "pm"

      529 => (First => 2_477, Last => 2_478),
      --  530: "pl"

      530 => (First => 2_479, Last => 2_480),
      --  531: "piątek"

      531 => (First => 2_481, Last => 2_486),
      --  532: "piatok"

      532 => (First => 2_487, Last => 2_492),
      --  533: "pi"

      533 => (First => 2_481, Last => 2_482),
      --  534: "perjantaina"

      534 => (First => 2_493, Last => 2_503),
      --  535: "pe"

      535 => (First => 2_493, Last => 2_494),
      --  536: "października"

      536 => (First => 2_504, Last => 2_515),
      --  537: "paź"

      537 => (First => 2_504, Last => 2_506),
      --  538: "p.n.e."

      538 => (First => 2_516, Last => 2_521),
      --  539: "p.m."

      539 => (First => 2_522, Last => 2_525),
      --  540: "p. m."

      540 => (First => 2_526, Last => 2_530),
      --  541: "p"

      541 => (First => 1_559, Last => 1_559),
      --  542: "outubro"

      542 => (First => 2_531, Last => 2_537),
      --  543: "out"

      543 => (First => 2_531, Last => 2_533),
      --  544: "ottobre"

      544 => (First => 2_538, Last => 2_544),
      --  545: "ott"

      545 => (First => 2_538, Last => 2_540),
      --  546: "onsdag"

      546 => (First => 2_545, Last => 2_550),
      --  547: "ons."

      547 => (First => 2_551, Last => 2_554),
      --  548: "ons"

      548 => (First => 2_545, Last => 2_547),
      --  549: "októbra"

      549 => (First => 2_555, Last => 2_561),
      --  550: "október"

      550 => (First => 2_562, Last => 2_568),
      --  551: "oktober"

      551 => (First => 2_569, Last => 2_575),
      --  552: "okt."

      552 => (First => 2_576, Last => 2_579),
      --  553: "okt"

      553 => (First => 1_982, Last => 1_984),
      --  554: "odpoludnia"

      554 => (First => 2_580, Last => 2_589),
      --  555: "octubre"

      555 => (First => 2_590, Last => 2_596),
      --  556: "octombrie"

      556 => (First => 2_597, Last => 2_605),
      --  557: "octobre"

      557 => (First => 2_606, Last => 2_612),
      --  558: "oct."

      558 => (First => 2_613, Last => 2_616),
      --  559: "o"

      559 => (First => 1_492, Last => 1_492),
      --  560: "noviembre"

      560 => (First => 2_617, Last => 2_625),
      --  561: "novembro"

      561 => (First => 2_626, Last => 2_633),
      --  562: "novembre"

      562 => (First => 2_634, Last => 2_641),
      --  563: "novembra"

      563 => (First => 2_642, Last => 2_649),
      --  564: "november"

      564 => (First => 2_650, Last => 2_657),
      --  565: "nov."

      565 => (First => 2_658, Last => 2_661),
      --  566: "nov"

      566 => (First => 2_617, Last => 2_619),
      --  567: "noon"

      567 => (First => 2_662, Last => 2_665),
      --  568: "noite"

      568 => (First => 2_666, Last => 2_670),
      --  569: "noiembrie"

      569 => (First => 2_671, Last => 2_679),
      --  570: "nl"

      570 => (First => 2_680, Last => 2_681),
      --  571: "night"

      571 => (First => 2_682, Last => 2_686),
      --  572: "niedziela"

      572 => (First => 2_687, Last => 2_695),
      --  573: "niedz."

      573 => (First => 2_696, Last => 2_701),
      --  574: "neděle"

      574 => (First => 2_702, Last => 2_707),
      --  575: "nedeľa"

      575 => (First => 2_708, Last => 2_713),
      --  576: "ne"

      576 => (First => 1_923, Last => 1_924),
      --  577: "nb"

      577 => (First => 2_714, Last => 2_715),
      --  578: "nad ranem"

      578 => (First => 2_716, Last => 2_724),
      --  579: "nachts"

      579 => (First => 2_725, Last => 2_730),
      --  580: "nachmittags"

      580 => (First => 2_731, Last => 2_741),
      --  581: "nachm."

      581 => (First => 2_742, Last => 2_747),
      --  582: "n.e."

      582 => (First => 2_518, Last => 2_521),
      --  583: "n.Chr."

      583 => (First => 2_748, Last => 2_753),
      --  584: "n. l."

      584 => (First => 2_359, Last => 2_363),
      --  585: "n. Chr."

      585 => (First => 2_754, Last => 2_760),
      --  586: "n"

      586 => (First => 1_510, Last => 1_510),
      --  587: "måndag"

      587 => (First => 2_761, Last => 2_766),
      --  588: "mån"

      588 => (First => 2_761, Last => 2_763),
      --  589: "március"

      589 => (First => 2_767, Last => 2_773),
      --  590: "márc."

      590 => (First => 2_774, Last => 2_778),
      --  591: "május"

      591 => (First => 2_779, Last => 2_783),
      --  592: "mája"

      592 => (First => 2_784, Last => 2_787),
      --  593: "máj."

      593 => (First => 2_788, Last => 2_791),
      --  594: "máj"

      594 => (First => 2_779, Last => 2_781),
      --  595: "mrt."

      595 => (First => 2_792, Last => 2_795),
      --  596: "morning"

      596 => (First => 2_796, Last => 2_802),
      --  597: "morgens"

      597 => (First => 2_803, Last => 2_809),
      --  598: "miércoles"

      598 => (First => 2_810, Last => 2_818),
      --  599: "mié."

      599 => (First => 2_819, Last => 2_822),
      --  600: "miercuri"

      600 => (First => 2_823, Last => 2_830),
      --  601: "midi"

      601 => (First => 2_831, Last => 2_834),
      --  602: "middag"

      602 => (First => 2_835, Last => 2_840),
      --  603: "midDay"

      603 => (First => 2_841, Last => 2_846),
      --  604: "meán lae"

      604 => (First => 2_847, Last => 2_854),
      --  605: "mezzogiorno"

      605 => (First => 2_855, Last => 2_865),
      --  606: "mercredi"

      606 => (First => 2_866, Last => 2_873),
      --  607: "mercoledì"

      607 => (First => 2_874, Last => 2_882),
      --  608: "mer."

      608 => (First => 2_883, Last => 2_886),
      --  609: "mer"

      609 => (First => 2_866, Last => 2_868),
      --  610: "meio-dia"

      610 => (First => 2_887, Last => 2_894),
      --  611: "mei"

      611 => (First => 2_887, Last => 2_889),
      --  612: "mediodía"

      612 => (First => 2_895, Last => 2_902),
      --  613: "mayo"

      613 => (First => 2_903, Last => 2_906),
      --  614: "may."

      614 => (First => 2_907, Last => 2_910),
      --  615: "matin"

      615 => (First => 2_911, Last => 2_915),
      --  616: "marți"

      616 => (First => 2_916, Last => 2_920),
      --  617: "março"

      617 => (First => 2_921, Last => 2_925),
      --  618: "marzo"

      618 => (First => 2_926, Last => 2_930),
      --  619: "marts"

      619 => (First => 2_931, Last => 2_935),
      --  620: "martie"

      620 => (First => 2_936, Last => 2_941),
      --  621: "martes"

      621 => (First => 2_942, Last => 2_947),
      --  622: "martedì"

      622 => (First => 2_948, Last => 2_954),
      --  623: "mars"

      623 => (First => 2_955, Last => 2_958),
      --  624: "marraskuuta"

      624 => (First => 2_959, Last => 2_969),
      --  625: "mardi"

      625 => (First => 2_970, Last => 2_974),
      --  626: "marca"

      626 => (First => 2_975, Last => 2_979),
      --  627: "mar."

      627 => (First => 2_980, Last => 2_983),
      --  628: "mar"

      628 => (First => 2_916, Last => 2_918),
      --  629: "manhã"

      629 => (First => 2_984, Last => 2_988),
      --  630: "mandag"

      630 => (First => 2_989, Last => 2_994),
      --  631: "man."

      631 => (First => 2_995, Last => 2_998),
      --  632: "maja"

      632 => (First => 2_999, Last => 3_002),
      --  633: "maj"

      633 => (First => 2_999, Last => 3_001),
      --  634: "maio"

      634 => (First => 3_003, Last => 3_006),
      --  635: "mai"

      635 => (First => 3_003, Last => 3_005),
      --  636: "maggio"

      636 => (First => 3_007, Last => 3_012),
      --  637: "mag"

      637 => (First => 3_007, Last => 3_009),
      --  638: "maart"

      638 => (First => 3_013, Last => 3_017),
      --  639: "maandag"

      639 => (First => 3_018, Last => 3_024),
      --  640: "maanantaina"

      640 => (First => 3_025, Last => 3_035),
      --  641: "maaliskuuta"

      641 => (First => 3_036, Last => 3_046),
      --  642: "ma"

      642 => (First => 2_903, Last => 2_904),
      --  643: "m"

      643 => (First => 1_582, Last => 1_582),
      --  644: "lørdag"

      644 => (First => 3_047, Last => 3_052),
      --  645: "lør."

      645 => (First => 3_053, Last => 3_056),
      --  646: "lördag"

      646 => (First => 3_057, Last => 3_062),
      --  647: "lör"

      647 => (First => 3_057, Last => 3_059),
      --  648: "lutego"

      648 => (First => 3_063, Last => 3_068),
      --  649: "lut"

      649 => (First => 3_063, Last => 3_065),
      --  650: "luni"

      650 => (First => 3_069, Last => 3_072),
      --  651: "lunes"

      651 => (First => 3_073, Last => 3_077),
      --  652: "lunedì"

      652 => (First => 3_078, Last => 3_083),
      --  653: "lundi"

      653 => (First => 3_084, Last => 3_088),
      --  654: "lun."

      654 => (First => 3_089, Last => 3_092),
      --  655: "lun"

      655 => (First => 3_069, Last => 3_071),
      --  656: "luglio"

      656 => (First => 3_093, Last => 3_098),
      --  657: "lug"

      657 => (First => 3_093, Last => 3_095),
      --  658: "lokakuuta"

      658 => (First => 3_099, Last => 3_107),
      --  659: "listopadu"

      659 => (First => 3_108, Last => 3_116),
      --  660: "listopada"

      660 => (First => 3_117, Last => 3_125),
      --  661: "lis"

      661 => (First => 1_562, Last => 1_564),
      --  662: "lipca"

      662 => (First => 3_126, Last => 3_130),
      --  663: "lip"

      663 => (First => 3_126, Last => 3_128),
      --  664: "left-to-right"

      664 => (First => 3_131, Last => 3_143),
      --  665: "ledna"

      665 => (First => 3_144, Last => 3_148),
      --  666: "led"

      666 => (First => 2_455, Last => 2_457),
      --  667: "lauantaina"

      667 => (First => 3_149, Last => 3_158),
      --  668: "latn"

      668 => (First => 3_159, Last => 3_162),
      --  669: "lateMorning"

      669 => (First => 3_163, Last => 3_173),
      --  670: "la prânz"

      670 => (First => 3_174, Last => 3_181),
      --  671: "la"

      671 => (First => 2_694, Last => 2_695),
      --  672: "l"

      672 => (First => 1_551, Last => 1_551),
      --  673: "kwietnia"

      673 => (First => 3_182, Last => 3_189),
      --  674: "kwi"

      674 => (First => 3_182, Last => 3_184),
      --  675: "května"

      675 => (First => 3_190, Last => 3_195),
      --  676: "kvě"

      676 => (First => 3_190, Last => 3_192),
      --  677: "ko"

      677 => (First => 1_989, Last => 1_990),
      --  678: "kl. 12"

      678 => (First => 3_196, Last => 3_201),
      --  679: "kesäkuuta"

      679 => (First => 3_202, Last => 3_210),
      --  680: "keskiviikkona"

      680 => (First => 3_211, Last => 3_223),
      --  681: "keskipäivä"

      681 => (First => 3_224, Last => 3_233),
      --  682: "kedd"

      682 => (First => 3_234, Last => 3_237),
      --  683: "ke"

      683 => (First => 3_202, Last => 3_203),
      --  684: "k"

      684 => (First => 1_493, Last => 1_493),
      --  685: "június"

      685 => (First => 3_238, Last => 3_243),
      --  686: "júna"

      686 => (First => 3_244, Last => 3_247),
      --  687: "jún."

      687 => (First => 3_248, Last => 3_251),
      --  688: "jún"

      688 => (First => 3_238, Last => 3_240),
      --  689: "július"

      689 => (First => 3_252, Last => 3_257),
      --  690: "júla"

      690 => (First => 3_258, Last => 3_261),
      --  691: "júl."

      691 => (First => 3_262, Last => 3_265),
      --  692: "júl"

      692 => (First => 3_252, Last => 3_254),
      --  693: "junio"

      693 => (First => 3_266, Last => 3_270),
      --  694: "juni"

      694 => (First => 3_266, Last => 3_269),
      --  695: "junho"

      695 => (First => 3_271, Last => 3_275),
      --  696: "jun."

      696 => (First => 3_276, Last => 3_279),
      --  697: "jun"

      697 => (First => 3_266, Last => 3_268),
      --  698: "julio"

      698 => (First => 3_280, Last => 3_284),
      --  699: "juli"

      699 => (First => 3_280, Last => 3_283),
      --  700: "julho"

      700 => (First => 3_285, Last => 3_289),
      --  701: "jul."

      701 => (First => 3_290, Last => 3_293),
      --  702: "jul"

      702 => (First => 3_280, Last => 3_282),
      --  703: "juin"

      703 => (First => 3_294, Last => 3_297),
      --  704: "juillet"

      704 => (First => 3_298, Last => 3_304),
      --  705: "juil."

      705 => (First => 3_305, Last => 3_309),
      --  706: "jueves"

      706 => (First => 3_310, Last => 3_315),
      --  707: "jue."

      707 => (First => 3_316, Last => 3_319),
      --  708: "joulukuuta"

      708 => (First => 3_320, Last => 3_329),
      --  709: "joi"

      709 => (First => 3_330, Last => 3_332),
      --  710: "jeudi"

      710 => (First => 3_333, Last => 3_337),
      --  711: "jeu."

      711 => (First => 3_338, Last => 3_341),
      --  712: "janvier"

      712 => (First => 3_342, Last => 3_348),
      --  713: "janv."

      713 => (First => 3_349, Last => 3_353),
      --  714: "januára"

      714 => (First => 3_354, Last => 3_360),
      --  715: "január"

      715 => (First => 3_354, Last => 3_359),
      --  716: "januari"

      716 => (First => 3_361, Last => 3_367),
      --  717: "januar"

      717 => (First => 3_361, Last => 3_366),
      --  718: "janeiro"

      718 => (First => 3_368, Last => 3_374),
      --  719: "jan."

      719 => (First => 3_375, Last => 3_378),
      --  720: "jan"

      720 => (First => 2_496, Last => 2_498),
      --  721: "ja"

      721 => (First => 2_496, Last => 2_497),
      --  722: "jKr."

      722 => (First => 3_379, Last => 3_382),
      --  723: "j"

      723 => (First => 1_509, Last => 1_509),
      --  724: "iunie"

      724 => (First => 3_383, Last => 3_387),
      --  725: "iun."

      725 => (First => 3_388, Last => 3_391),
      --  726: "iulie"

      726 => (First => 3_392, Last => 3_396),
      --  727: "iul."

      727 => (First => 3_397, Last => 3_400),
      --  728: "it"

      728 => (First => 1_910, Last => 1_911),
      --  729: "ip."

      729 => (First => 3_401, Last => 3_403),
      --  730: "ianuarie"

      730 => (First => 3_404, Last => 3_411),
      --  731: "ian."

      731 => (First => 3_412, Last => 3_415),
      --  732: "i. sz."

      732 => (First => 3_416, Last => 3_421),
      --  733: "i. e."

      733 => (First => 3_422, Last => 3_426),
      --  734: "hétfő"

      734 => (First => 3_427, Last => 3_431),
      --  735: "huhtikuuta"

      735 => (First => 3_432, Last => 3_441),
      --  736: "hu"

      736 => (First => 3_432, Last => 3_433),
      --  737: "helmikuuta"

      737 => (First => 3_442, Last => 3_451),
      --  738: "heinäkuuta"

      738 => (First => 3_452, Last => 3_461),
      --  739: "he"

      739 => (First => 3_442, Last => 3_443),
      --  740: "h:mm:ss a zzzz"

      740 => (First => 3_462, Last => 3_475),
      --  741: "h:mm:ss a z"

      741 => (First => 3_462, Last => 3_472),
      --  742: "h:mm:ss a"

      742 => (First => 3_462, Last => 3_470),
      --  743: "h:mm a"

      743 => (First => 3_476, Last => 3_481),
      --  744: "grudnia"

      744 => (First => 3_482, Last => 3_488),
      --  745: "gru"

      745 => (First => 3_482, Last => 3_484),
      --  746: "giugno"

      746 => (First => 3_489, Last => 3_494),
      --  747: "giu"

      747 => (First => 3_489, Last => 3_491),
      --  748: "giovedì"

      748 => (First => 3_495, Last => 3_501),
      --  749: "gio"

      749 => (First => 2_860, Last => 2_862),
      --  750: "gennaio"

      750 => (First => 3_502, Last => 3_508),
      --  751: "gen"

      751 => (First => 2_375, Last => 2_377),
      --  752: "ga"

      752 => (First => 3_509, Last => 3_510),
      --  753: "g"

      753 => (First => 1_727, Last => 1_727),
      --  754: "février"

      754 => (First => 3_511, Last => 3_517),
      --  755: "févr."

      755 => (First => 3_518, Last => 3_522),
      --  756: "fredag"

      756 => (First => 3_523, Last => 3_528),
      --  757: "fre."

      757 => (First => 3_529, Last => 3_532),
      --  758: "fre"

      758 => (First => 3_523, Last => 3_525),
      --  759: "fr"

      759 => (First => 3_523, Last => 3_524),
      --  760: "fm"

      760 => (First => 3_533, Last => 3_534),
      --  761: "fi"

      761 => (First => 3_535, Last => 3_536),
      --  762: "fevereiro"

      762 => (First => 3_537, Last => 3_545),
      --  763: "fev"

      763 => (First => 3_537, Last => 3_539),
      --  764: "februára"

      764 => (First => 3_546, Last => 3_553),
      --  765: "február"

      765 => (First => 3_546, Last => 3_552),
      --  766: "februarie"

      766 => (First => 3_554, Last => 3_562),
      --  767: "februari"

      767 => (First => 3_554, Last => 3_561),
      --  768: "februar"

      768 => (First => 3_554, Last => 3_560),
      --  769: "febrero"

      769 => (First => 3_563, Last => 3_569),
      --  770: "febr."

      770 => (First => 3_570, Last => 3_574),
      --  771: "febbraio"

      771 => (First => 3_575, Last => 3_582),
      --  772: "feb."

      772 => (First => 3_583, Last => 3_586),
      --  773: "feb"

      773 => (First => 3_546, Last => 3_548),
      --  774: "f.Kr."

      774 => (First => 3_587, Last => 3_591),
      --  775: "f"

      775 => (First => 2_050, Last => 2_050),
      --  776: "evening"

      776 => (First => 3_592, Last => 3_598),
      --  777: "es"

      777 => (First => 1_932, Last => 1_933),
      --  778: "epäluku"

      778 => (First => 3_599, Last => 3_605),
      --  779: "enero"

      779 => (First => 3_606, Last => 3_610),
      --  780: "ene."

      780 => (First => 3_611, Last => 3_614),
      --  781: "en_ZA"

      781 => (First => 3_615, Last => 3_619),
      --  782: "en_NZ"

      782 => (First => 3_620, Last => 3_624),
      --  783: "en_IE"

      783 => (First => 3_625, Last => 3_629),
      --  784: "en_GB"

      784 => (First => 3_630, Last => 3_634),
      --  785: "en_CA"

      785 => (First => 3_635, Last => 3_639),
      --  786: "en_AU"

      786 => (First => 3_640, Last => 3_644),
      --  787: "en"

      787 => (First => 1_535, Last => 1_536),
      --  788: "em"

      788 => (First => 1_873, Last => 1_874),
      --  789: "elokuuta"

      789 => (First => 3_645, Last => 3_652),
      --  790: "el"

      790 => (First => 2_437, Last => 2_438),
      --  791: "earlyMorning"

      791 => (First => 3_653, Last => 3_664),
      --  792: "eKr."

      792 => (First => 3_665, Last => 3_668),
      --  793: "e.Kr."

      793 => (First => 3_669, Last => 3_673),
      --  794: "e"

      794 => (First => 1_523, Last => 1_523),
      --  795: "d‏/M‏/y"

      795 => (First => 3_674, Last => 3_680),
      --  796: "dél"

      796 => (First => 3_681, Last => 3_683),
      --  797: "décembre"

      797 => (First => 3_684, Last => 3_691),
      --  798: "déc."

      798 => (First => 3_692, Last => 3_695),
      --  799: "duminică"

      799 => (First => 3_696, Last => 3_703),
      --  800: "dubna"

      800 => (First => 3_704, Last => 3_708),
      --  801: "dub"

      801 => (First => 3_704, Last => 3_706),
      --  802: "du."

      802 => (First => 3_709, Last => 3_711),
      --  803: "dopoludnia"

      803 => (First => 3_712, Last => 3_721),
      --  804: "donderdag"

      804 => (First => 3_722, Last => 3_730),
      --  805: "domingo"

      805 => (First => 3_731, Last => 3_737),
      --  806: "domenica"

      806 => (First => 3_738, Last => 3_745),
      --  807: "dom."

      807 => (First => 3_746, Last => 3_749),
      --  808: "dom"

      808 => (First => 3_731, Last => 3_733),
      --  809: "do"

      809 => (First => 2_097, Last => 2_098),
      --  810: "dinsdag"

      810 => (First => 3_750, Last => 3_756),
      --  811: "dimanche"

      811 => (First => 3_757, Last => 3_764),
      --  812: "dim."

      812 => (First => 3_765, Last => 3_768),
      --  813: "diciembre"

      813 => (First => 3_769, Last => 3_777),
      --  814: "dicembre"

      814 => (First => 3_778, Last => 3_785),
      --  815: "dic."

      815 => (First => 3_786, Last => 3_789),
      --  816: "dic"

      816 => (First => 3_769, Last => 3_771),
      --  817: "di"

      817 => (First => 1_951, Last => 1_952),
      --  818: "dezembro"

      818 => (First => 3_790, Last => 3_797),
      --  819: "dez"

      819 => (First => 3_790, Last => 3_792),
      --  820: "desember"

      820 => (First => 3_798, Last => 3_805),
      --  821: "des."

      821 => (First => 3_806, Last => 3_809),
      --  822: "decembrie"

      822 => (First => 3_810, Last => 3_818),
      --  823: "decembra"

      823 => (First => 3_819, Last => 3_826),
      --  824: "december"

      824 => (First => 3_827, Last => 3_834),
      --  825: "dec."

      825 => (First => 3_835, Last => 3_838),
      --  826: "dec"

      826 => (First => 3_810, Last => 3_812),
      --  827: "de."

      827 => (First => 3_839, Last => 3_841),
      --  828: "de"

      828 => (First => 2_058, Last => 2_059),
      --  829: "dd‏/MM‏/y"

      829 => (First => 3_842, Last => 3_850),
      --  830: "dd/MM/yy"

      830 => (First => 3_851, Last => 3_858),
      --  831: "dd/MM/y"

      831 => (First => 3_851, Last => 3_857),
      --  832: "dd.MM.yy"

      832 => (First => 3_859, Last => 3_866),
      --  833: "dd.MM.y"

      833 => (First => 3_859, Last => 3_865),
      --  834: "dd-MM-yy"

      834 => (First => 3_867, Last => 3_874),
      --  835: "dd MMMM y"

      835 => (First => 3_875, Last => 3_883),
      --  836: "dd MMM y"

      836 => (First => 3_884, Last => 3_891),
      --  837: "da"

      837 => (First => 1_502, Last => 1_503),
      --  838: "dC"

      838 => (First => 3_892, Last => 3_893),
      --  839: "d/MM/yy"

      839 => (First => 3_852, Last => 3_858),
      --  840: "d/MM/y"

      840 => (First => 3_852, Last => 3_857),
      --  841: "d/M/yy"

      841 => (First => 3_894, Last => 3_899),
      --  842: "d.MM.y"

      842 => (First => 3_860, Last => 3_865),
      --  843: "d.M.y"

      843 => (First => 3_900, Last => 3_904),
      --  844: "d.Hr."

      844 => (First => 3_905, Last => 3_909),
      --  845: "d.C."

      845 => (First => 3_910, Last => 3_913),
      --  846: "d. MMMM y"

      846 => (First => 3_914, Last => 3_922),
      --  847: "d. MMM y"

      847 => (First => 3_923, Last => 3_930),
      --  848: "d. M. y"

      848 => (First => 3_931, Last => 3_937),
      --  849: "d. C."

      849 => (First => 3_938, Last => 3_942),
      --  850: "d בMMMM y"

      850 => (First => 3_943, Last => 3_951),
      --  851: "d בMMM y"

      851 => (First => 3_952, Last => 3_959),
      --  852: "d MMMM، y"

      852 => (First => 3_960, Last => 3_968),
      --  853: "d MMMM y EEEE"

      853 => (First => 3_969, Last => 3_981),
      --  854: "d MMMM y 'г'."

      854 => (First => 3_982, Last => 3_994),
      --  855: "d MMMM y"

      855 => (First => 3_876, Last => 3_883),
      --  856: "d MMMM G y"

      856 => (First => 3_995, Last => 4_004),
      --  857: "d MMM y 'г'."

      857 => (First => 4_005, Last => 4_016),
      --  858: "d MMM y"

      858 => (First => 3_885, Last => 3_891),
      --  859: "d 'de' MMMM 'de' y"

      859 => (First => 4_017, Last => 4_034),
      --  860: "d 'de' MMM 'de' y"

      860 => (First => 4_035, Last => 4_051),
      --  861: "d"

      861 => (First => 1_502, Last => 1_502),
      --  862: "czwartek"

      862 => (First => 4_052, Last => 4_059),
      --  863: "czw."

      863 => (First => 4_060, Last => 4_063),
      --  864: "czerwca"

      864 => (First => 4_064, Last => 4_070),
      --  865: "cze"

      865 => (First => 4_064, Last => 4_066),
      --  866: "csütörtök"

      866 => (First => 4_071, Last => 4_079),
      --  867: "cs"

      867 => (First => 4_071, Last => 4_072),
      --  868: "cccc d. MMMM y"

      868 => (First => 4_080, Last => 4_093),
      --  869: "c"

      869 => (First => 1_517, Last => 1_517),
      --  870: "března"

      870 => (First => 4_094, Last => 4_099),
      --  871: "bře"

      871 => (First => 4_094, Last => 4_096),
      --  872: "avril"

      872 => (First => 4_100, Last => 4_104),
      --  873: "avr."

      873 => (First => 4_105, Last => 4_108),
      --  874: "av. J.-C."

      874 => (First => 4_109, Last => 4_117),
      --  875: "augusztus"

      875 => (First => 4_118, Last => 4_126),
      --  876: "augustus"

      876 => (First => 4_127, Last => 4_134),
      --  877: "augusti"

      877 => (First => 4_135, Last => 4_141),
      --  878: "augusta"

      878 => (First => 4_142, Last => 4_148),
      --  879: "august"

      879 => (First => 4_127, Last => 4_132),
      --  880: "aug."

      880 => (First => 4_149, Last => 4_152),
      --  881: "aug"

      881 => (First => 4_118, Last => 4_120),
      --  882: "arab"

      882 => (First => 4_153, Last => 4_156),
      --  883: "ar"

      883 => (First => 1_578, Last => 1_579),
      --  884: "apríla"

      884 => (First => 4_157, Last => 4_162),
      --  885: "après-midi"

      885 => (First => 4_163, Last => 4_172),
      --  886: "aprilie"

      886 => (First => 4_173, Last => 4_179),
      --  887: "aprile"

      887 => (First => 4_180, Last => 4_185),
      --  888: "april"

      888 => (First => 4_173, Last => 4_177),
      --  889: "apr."

      889 => (First => 4_186, Last => 4_189),
      --  890: "apr"

      890 => (First => 4_157, Last => 4_159),
      --  891: "ap. J.-C."

      891 => (First => 4_190, Last => 4_198),
      --  892: "ap."

      892 => (First => 2_515, Last => 2_517),
      --  893: "août"

      893 => (First => 4_199, Last => 4_202),
      --  894: "am"

      894 => (First => 1_581, Last => 1_582),
      --  895: "ah:mm:ss [zzzz]"

      895 => (First => 4_203, Last => 4_217),
      --  896: "ah:mm:ss [z]"

      896 => (First => 4_218, Last => 4_229),
      --  897: "ah:mm:ss"

      897 => (First => 1_714, Last => 1_721),
      --  898: "ah:mm"

      898 => (First => 1_714, Last => 1_718),
      --  899: "agosto"

      899 => (First => 4_230, Last => 4_235),
      --  900: "ago."

      900 => (First => 4_236, Last => 4_239),
      --  901: "ago"

      901 => (First => 2_549, Last => 2_551),
      --  902: "afternoon"

      902 => (First => 4_240, Last => 4_248),
      --  903: "abril"

      903 => (First => 4_249, Last => 4_253),
      --  904: "abr."

      904 => (First => 4_254, Last => 4_257),
      --  905: "abr"

      905 => (First => 4_249, Last => 4_251),
      --  906: "abends"

      906 => (First => 4_258, Last => 4_263),
      --  907: "aC"

      907 => (First => 4_264, Last => 4_265),
      --  908: "a.m."

      908 => (First => 4_266, Last => 4_269),
      --  909: "a.C."

      909 => (First => 4_270, Last => 4_273),
      --  910: "a. m."

      910 => (First => 4_274, Last => 4_278),
      --  911: "a. C."

      911 => (First => 4_279, Last => 4_283),
      --  912: "a h시 m분 s초 zzzz"

      912 => (First => 4_284, Last => 4_298),
      --  913: "a h시 m분 s초 z"

      913 => (First => 4_284, Last => 4_295),
      --  914: "a h:mm:ss"

      914 => (First => 4_299, Last => 4_307),
      --  915: "a h:mm"

      915 => (First => 4_299, Last => 4_304),
      --  916: "a"

      916 => (First => 1_497, Last => 1_497),
      --  917: "Wednesday"

      917 => (First => 4_308, Last => 4_316),
      --  918: "Wed"

      918 => (First => 4_308, Last => 4_310),
      --  919: "Vin"

      919 => (First => 4_317, Last => 4_319),
      --  920: "V"

      920 => (First => 4_317, Last => 4_317),
      --  921: "Tuesday"

      921 => (First => 4_320, Last => 4_326),
      --  922: "Tue"

      922 => (First => 4_320, Last => 4_322),
      --  923: "Thursday"

      923 => (First => 4_327, Last => 4_334),
      --  924: "Thu"

      924 => (First => 4_327, Last => 4_329),
      --  925: "Temmuz"

      925 => (First => 4_335, Last => 4_340),
      --  926: "Tem"

      926 => (First => 4_335, Last => 4_337),
      --  927: "T"

      927 => (First => 4_320, Last => 4_320),
      --  928: "Sâm"

      928 => (First => 4_341, Last => 4_343),
      --  929: "Szo"

      929 => (First => 4_344, Last => 4_346),
      --  930: "Sze"

      930 => (First => 4_347, Last => 4_349),
      --  931: "Sz"

      931 => (First => 4_344, Last => 4_345),
      --  932: "Sunday"

      932 => (First => 4_350, Last => 4_355),
      --  933: "Sun"

      933 => (First => 4_350, Last => 4_352),
      --  934: "Sonntag"

      934 => (First => 4_356, Last => 4_362),
      --  935: "So."

      935 => (First => 4_363, Last => 4_365),
      --  936: "September"

      936 => (First => 4_366, Last => 4_374),
      --  937: "Sep."

      937 => (First => 4_375, Last => 4_378),
      --  938: "Sep"

      938 => (First => 4_366, Last => 4_368),
      --  939: "Saturday"

      939 => (First => 4_379, Last => 4_386),
      --  940: "Sath"

      940 => (First => 4_387, Last => 4_390),
      --  941: "Sat"

      941 => (First => 4_379, Last => 4_381),
      --  942: "Samstag"

      942 => (First => 4_391, Last => 4_397),
      --  943: "Samhain"

      943 => (First => 4_398, Last => 4_404),
      --  944: "Samh"

      944 => (First => 4_398, Last => 4_401),
      --  945: "Salı"

      945 => (First => 4_405, Last => 4_408),
      --  946: "Sal"

      946 => (First => 4_405, Last => 4_407),
      --  947: "Sa."

      947 => (First => 4_409, Last => 4_411),
      --  948: "S"

      948 => (First => 1_576, Last => 1_576),
      --  949: "RC"

      949 => (First => 4_412, Last => 4_413),
      --  950: "Pzt"

      950 => (First => 4_414, Last => 4_416),
      --  951: "Perşembe"

      951 => (First => 4_417, Last => 4_424),
      --  952: "Per"

      952 => (First => 4_417, Last => 4_419),
      --  953: "Pazartesi"

      953 => (First => 4_425, Last => 4_433),
      --  954: "Pazar"

      954 => (First => 4_425, Last => 4_429),
      --  955: "Paz"

      955 => (First => 4_425, Last => 4_427),
      --  956: "PM"

      956 => (First => 4_434, Last => 4_435),
      --  957: "P"

      957 => (First => 4_414, Last => 4_414),
      --  958: "Oktober"

      958 => (First => 4_436, Last => 4_442),
      --  959: "Okt."

      959 => (First => 4_443, Last => 4_446),
      --  960: "October"

      960 => (First => 4_447, Last => 4_453),
      --  961: "Oct"

      961 => (First => 4_447, Last => 4_449),
      --  962: "Ocak"

      962 => (First => 4_454, Last => 4_457),
      --  963: "Oca"

      963 => (First => 4_454, Last => 4_456),
      --  964: "O"

      964 => (First => 4_436, Last => 4_436),
      --  965: "November"

      965 => (First => 4_458, Last => 4_465),
      --  966: "Nov."

      966 => (First => 4_466, Last => 4_469),
      --  967: "Nov"

      967 => (First => 4_458, Last => 4_460),
      --  968: "Nollaig"

      968 => (First => 4_470, Last => 4_476),
      --  969: "Noll"

      969 => (First => 4_470, Last => 4_473),
      --  970: "Nisan"

      970 => (First => 4_477, Last => 4_481),
      --  971: "Nis"

      971 => (First => 4_477, Last => 4_479),
      --  972: "NaN"

      972 => (First => 4_482, Last => 4_484),
      --  973: "N"

      973 => (First => 3_623, Last => 3_623),
      --  974: "März"

      974 => (First => 4_485, Last => 4_488),
      --  975: "Márta"

      975 => (First => 4_489, Last => 4_493),
      --  976: "Máirt"

      976 => (First => 4_494, Last => 4_498),
      --  977: "MÖ"

      977 => (First => 4_499, Last => 4_500),
      --  978: "Montag"

      978 => (First => 4_501, Last => 4_506),
      --  979: "Monday"

      979 => (First => 4_507, Last => 4_512),
      --  980: "Mon"

      980 => (First => 4_501, Last => 4_503),
      --  981: "Mo."

      981 => (First => 4_513, Last => 4_515),
      --  982: "Mittwoch"

      982 => (First => 4_516, Last => 4_523),
      --  983: "Mittag"

      983 => (First => 4_524, Last => 4_529),
      --  984: "Mie"

      984 => (First => 4_530, Last => 4_532),
      --  985: "Mi."

      985 => (First => 4_533, Last => 4_535),
      --  986: "Meán Fómhair"

      986 => (First => 4_536, Last => 4_547),
      --  987: "Meitheamh"

      987 => (First => 4_548, Last => 4_556),
      --  988: "Meith"

      988 => (First => 4_548, Last => 4_552),
      --  989: "Mayıs"

      989 => (First => 4_557, Last => 4_561),
      --  990: "May"

      990 => (First => 4_557, Last => 4_559),
      --  991: "Mart"

      991 => (First => 4_562, Last => 4_565),
      --  992: "March"

      992 => (First => 4_566, Last => 4_570),
      --  993: "Mar"

      993 => (First => 4_562, Last => 4_564),
      --  994: "Mai"

      994 => (First => 4_571, Last => 4_573),
      --  995: "MS"

      995 => (First => 4_574, Last => 4_575),
      --  996: "MMMM d, y"

      996 => (First => 4_576, Last => 4_584),
      --  997: "MMM d, y"

      997 => (First => 4_577, Last => 4_584),
      --  998: "MFómh"

      998 => (First => 4_585, Last => 4_589),
      --  999: "M/d/yy"

      999 => (First => 4_590, Last => 4_595),
      --  1000: "M"

      1_000 => (First => 1_746, Last => 1_746),
      --  1001: "Lúnasa"

      1_001 => (First => 4_596, Last => 4_601),
      --  1002: "Lún"

      1_002 => (First => 4_596, Last => 4_598),
      --  1003: "Lun"

      1_003 => (First => 4_602, Last => 4_604),
      --  1004: "Luan"

      1_004 => (First => 4_605, Last => 4_608),
      --  1005: "L"

      1_005 => (First => 4_596, Last => 4_596),
      --  1006: "Kasım"

      1_006 => (First => 4_609, Last => 4_613),
      --  1007: "Kas"

      1_007 => (First => 4_609, Last => 4_611),
      --  1008: "K"

      1_008 => (First => 2_411, Last => 2_411),
      --  1009: "Juni"

      1_009 => (First => 4_614, Last => 4_617),
      --  1010: "June"

      1_010 => (First => 4_618, Last => 4_621),
      --  1011: "Jun"

      1_011 => (First => 4_614, Last => 4_616),
      --  1012: "July"

      1_012 => (First => 4_622, Last => 4_625),
      --  1013: "Juli"

      1_013 => (First => 4_626, Last => 4_629),
      --  1014: "Jul"

      1_014 => (First => 4_622, Last => 4_624),
      --  1015: "Joi"

      1_015 => (First => 4_630, Last => 4_632),
      --  1016: "January"

      1_016 => (First => 4_633, Last => 4_639),
      --  1017: "Januar"

      1_017 => (First => 4_633, Last => 4_638),
      --  1018: "Jan."

      1_018 => (First => 4_640, Last => 4_643),
      --  1019: "Jan"

      1_019 => (First => 4_633, Last => 4_635),
      --  1020: "J"

      1_020 => (First => 4_113, Last => 4_113),
      --  1021: "Iúil"

      1_021 => (First => 4_644, Last => 4_647),
      --  1022: "Inf"

      1_022 => (First => 4_648, Last => 4_650),
      --  1023: "I"

      1_023 => (First => 3_628, Last => 3_628),
      --  1024: "H時mm分ss秒 zzzz"

      1_024 => (First => 4_651, Last => 4_663),
      --  1025: "Haziran"

      1_025 => (First => 4_664, Last => 4_670),
      --  1026: "Haz"

      1_026 => (First => 4_664, Last => 4_666),
      --  1027: "HH:mm:ss zzzz"

      1_027 => (First => 4_671, Last => 4_683),
      --  1028: "HH:mm:ss z"

      1_028 => (First => 4_671, Last => 4_680),
      --  1029: "HH:mm:ss"

      1_029 => (First => 4_671, Last => 4_678),
      --  1030: "HH:mm"

      1_030 => (First => 4_671, Last => 4_675),
      --  1031: "HH.mm.ss zzzz"

      1_031 => (First => 4_684, Last => 4_696),
      --  1032: "HH.mm.ss z"

      1_032 => (First => 4_684, Last => 4_693),
      --  1033: "HH.mm.ss"

      1_033 => (First => 4_684, Last => 4_691),
      --  1034: "HH.mm"

      1_034 => (First => 4_684, Last => 4_688),
      --  1035: "H:mm:ss zzzz"

      1_035 => (First => 4_672, Last => 4_683),
      --  1036: "H:mm:ss z"

      1_036 => (First => 4_672, Last => 4_680),
      --  1037: "H:mm:ss (zzzz)"

      1_037 => (First => 4_697, Last => 4_710),
      --  1038: "H:mm:ss"

      1_038 => (First => 4_672, Last => 4_678),
      --  1039: "H:mm"

      1_039 => (First => 4_672, Last => 4_675),
      --  1040: "H.mm.ss zzzz"

      1_040 => (First => 4_685, Last => 4_696),
      --  1041: "H.mm.ss z"

      1_041 => (First => 4_685, Last => 4_693),
      --  1042: "H.mm.ss"

      1_042 => (First => 4_685, Last => 4_691),
      --  1043: "H.mm"

      1_043 => (First => 4_685, Last => 4_688),
      --  1044: "H นาฬิกา mm นาที ss วินาที zzzz"

      1_044 => (First => 4_711, Last => 4_741),
      --  1045: "H นาฬิกา mm นาที ss วินาที z"

      1_045 => (First => 4_711, Last => 4_738),
      --  1046: "H"

      1_046 => (First => 1_555, Last => 1_555),
      --  1047: "G"

      1_047 => (First => 3_633, Last => 3_633),
      --  1048: "Friday"

      1_048 => (First => 4_742, Last => 4_747),
      --  1049: "Fri"

      1_049 => (First => 4_742, Last => 4_744),
      --  1050: "Freitag"

      1_050 => (First => 4_748, Last => 4_754),
      --  1051: "Fr."

      1_051 => (First => 4_755, Last => 4_757),
      --  1052: "February"

      1_052 => (First => 4_758, Last => 4_765),
      --  1053: "Februar"

      1_053 => (First => 4_758, Last => 4_764),
      --  1054: "Feb."

      1_054 => (First => 4_766, Last => 4_769),
      --  1055: "Feb"

      1_055 => (First => 4_758, Last => 4_760),
      --  1056: "Feabhra"

      1_056 => (First => 4_770, Last => 4_776),
      --  1057: "Feabh"

      1_057 => (First => 4_770, Last => 4_774),
      --  1058: "F"

      1_058 => (First => 4_541, Last => 4_541),
      --  1059: "Eylül"

      1_059 => (First => 4_777, Last => 4_781),
      --  1060: "Eyl"

      1_060 => (First => 4_777, Last => 4_779),
      --  1061: "Ekim"

      1_061 => (First => 4_782, Last => 4_785),
      --  1062: "Eki"

      1_062 => (First => 4_782, Last => 4_784),
      --  1063: "Eanáir"

      1_063 => (First => 4_786, Last => 4_791),
      --  1064: "Ean"

      1_064 => (First => 4_786, Last => 4_788),
      --  1065: "EEEEที่ d MMMM G y"

      1_065 => (First => 4_792, Last => 4_809),
      --  1066: "EEEE، d MMMM، y"

      1_066 => (First => 4_810, Last => 4_824),
      --  1067: "EEEE, d. MMMM y"

      1_067 => (First => 4_825, Last => 4_839),
      --  1068: "EEEE, d בMMMM y"

      1_068 => (First => 4_840, Last => 4_854),
      --  1069: "EEEE, d MMMM y 'г'."

      1_069 => (First => 4_855, Last => 4_873),
      --  1070: "EEEE, d MMMM y"

      1_070 => (First => 4_855, Last => 4_868),
      --  1071: "EEEE, d 'de' MMMM 'de' y"

      1_071 => (First => 4_874, Last => 4_897),
      --  1072: "EEEE, MMMM d, y"

      1_072 => (First => 4_898, Last => 4_912),
      --  1073: "EEEE dd MMMM y"

      1_073 => (First => 4_913, Last => 4_926),
      --  1074: "EEEE d. MMMM y"

      1_074 => (First => 4_927, Last => 4_940),
      --  1075: "EEEE d MMMM y"

      1_075 => (First => 4_941, Last => 4_953),
      --  1076: "EEEE 'den' d. MMMM y"

      1_076 => (First => 4_954, Last => 4_973),
      --  1077: "E"

      1_077 => (First => 1_752, Last => 1_752),
      --  1078: "Déardaoin"

      1_078 => (First => 4_974, Last => 4_982),
      --  1079: "Déar"

      1_079 => (First => 4_974, Last => 4_977),
      --  1080: "Dé hAoine"

      1_080 => (First => 4_983, Last => 4_991),
      --  1081: "Dé Sathairn"

      1_081 => (First => 4_992, Last => 5_002),
      --  1082: "Dé Máirt"

      1_082 => (First => 5_003, Last => 5_010),
      --  1083: "Dé Luain"

      1_083 => (First => 5_011, Last => 5_018),
      --  1084: "Dé Domhnaigh"

      1_084 => (First => 5_019, Last => 5_030),
      --  1085: "Dé Céadaoin"

      1_085 => (First => 5_031, Last => 5_041),
      --  1086: "Dum"

      1_086 => (First => 5_042, Last => 5_044),
      --  1087: "Donnerstag"

      1_087 => (First => 5_045, Last => 5_054),
      --  1088: "Domh"

      1_088 => (First => 5_022, Last => 5_025),
      --  1089: "Do."

      1_089 => (First => 5_055, Last => 5_057),
      --  1090: "Dienstag"

      1_090 => (First => 5_058, Last => 5_065),
      --  1091: "Di."

      1_091 => (First => 5_066, Last => 5_068),
      --  1092: "Dezember"

      1_092 => (First => 5_069, Last => 5_076),
      --  1093: "Dez."

      1_093 => (First => 5_077, Last => 5_080),
      --  1094: "Deireadh Fómhair"

      1_094 => (First => 5_081, Last => 5_096),
      --  1095: "December"

      1_095 => (First => 5_097, Last => 5_104),
      --  1096: "Dec"

      1_096 => (First => 5_097, Last => 5_099),
      --  1097: "DFómh"

      1_097 => (First => 5_105, Last => 5_109),
      --  1098: "D"

      1_098 => (First => 2_844, Last => 2_844),
      --  1099: "Céad"

      1_099 => (First => 5_034, Last => 5_037),
      --  1100: "Cumartesi"

      1_100 => (First => 5_110, Last => 5_118),
      --  1101: "Cuma"

      1_101 => (First => 5_110, Last => 5_113),
      --  1102: "Cum"

      1_102 => (First => 5_110, Last => 5_112),
      --  1103: "Cs"

      1_103 => (First => 5_119, Last => 5_120),
      --  1104: "Cmt"

      1_104 => (First => 5_121, Last => 5_123),
      --  1105: "CE"

      1_105 => (First => 5_124, Last => 5_125),
      --  1106: "Bealtaine"

      1_106 => (First => 5_126, Last => 5_134),
      --  1107: "Beal"

      1_107 => (First => 5_126, Last => 5_129),
      --  1108: "BCE"

      1_108 => (First => 5_135, Last => 5_137),
      --  1109: "BC"

      1_109 => (First => 5_135, Last => 5_136),
      --  1110: "B"

      1_110 => (First => 3_634, Last => 3_634),
      --  1111: "Ağustos"

      1_111 => (First => 5_138, Last => 5_144),
      --  1112: "Ağu"

      1_112 => (First => 5_138, Last => 5_140),
      --  1113: "August"

      1_113 => (First => 5_145, Last => 5_150),
      --  1114: "Aug."

      1_114 => (First => 5_151, Last => 5_154),
      --  1115: "Aug"

      1_115 => (First => 5_145, Last => 5_147),
      --  1116: "Aralık"

      1_116 => (First => 5_155, Last => 5_160),
      --  1117: "Ara"

      1_117 => (First => 5_155, Last => 5_157),
      --  1118: "April"

      1_118 => (First => 5_161, Last => 5_165),
      --  1119: "Apr."

      1_119 => (First => 5_166, Last => 5_169),
      --  1120: "Apr"

      1_120 => (First => 5_161, Last => 5_163),
      --  1121: "Aoine"

      1_121 => (First => 4_987, Last => 4_991),
      --  1122: "Aibreán"

      1_122 => (First => 5_170, Last => 5_176),
      --  1123: "Aib"

      1_123 => (First => 5_170, Last => 5_172),
      --  1124: "AM"

      1_124 => (First => 5_177, Last => 5_178),
      --  1125: "AD"

      1_125 => (First => 5_179, Last => 5_180),
      --  1126: "A"

      1_126 => (First => 3_619, Last => 3_619),
      --  1127: ";"

      1_127 => (First => 1_599, Last => 1_599),
      --  1128: "9월"

      1_128 => (First => 5_181, Last => 5_182),
      --  1129: "9月"

      1_129 => (First => 5_183, Last => 5_184),
      --  1130: "9"

      1_130 => (First => 170, Last => 170),
      --  1131: "8월"

      1_131 => (First => 5_185, Last => 5_186),
      --  1132: "8月"

      1_132 => (First => 5_187, Last => 5_188),
      --  1133: "8"

      1_133 => (First => 169, Last => 169),
      --  1134: "7월"

      1_134 => (First => 5_189, Last => 5_190),
      --  1135: "7月"

      1_135 => (First => 5_191, Last => 5_192),
      --  1136: "7"

      1_136 => (First => 168, Last => 168),
      --  1137: "6월"

      1_137 => (First => 5_193, Last => 5_194),
      --  1138: "6月"

      1_138 => (First => 5_195, Last => 5_196),
      --  1139: "6"

      1_139 => (First => 167, Last => 167),
      --  1140: "5월"

      1_140 => (First => 5_197, Last => 5_198),
      --  1141: "5月"

      1_141 => (First => 5_199, Last => 5_200),
      --  1142: "5"

      1_142 => (First => 166, Last => 166),
      --  1143: "4월"

      1_143 => (First => 5_201, Last => 5_202),
      --  1144: "4月"

      1_144 => (First => 5_203, Last => 5_204),
      --  1145: "4"

      1_145 => (First => 165, Last => 165),
      --  1146: "3월"

      1_146 => (First => 5_205, Last => 5_206),
      --  1147: "3月"

      1_147 => (First => 5_207, Last => 5_208),
      --  1148: "3"

      1_148 => (First => 164, Last => 164),
      --  1149: "2월"

      1_149 => (First => 5_209, Last => 5_210),
      --  1150: "2月"

      1_150 => (First => 5_211, Last => 5_212),
      --  1151: "2"

      1_151 => (First => 163, Last => 163),
      --  1152: "1월"

      1_152 => (First => 5_213, Last => 5_214),
      --  1153: "1月"

      1_153 => (First => 5_215, Last => 5_216),
      --  1154: "12월"

      1_154 => (First => 5_217, Last => 5_219),
      --  1155: "12月"

      1_155 => (First => 5_220, Last => 5_222),
      --  1156: "12 uur ‘s middags"

      1_156 => (First => 5_223, Last => 5_239),
      --  1157: "12"

      1_157 => (First => 162, Last => 163),
      --  1158: "11월"

      1_158 => (First => 5_240, Last => 5_242),
      --  1159: "11月"

      1_159 => (First => 5_243, Last => 5_245),
      --  1160: "11"

      1_160 => (First => 5_240, Last => 5_241),
      --  1161: "10월"

      1_161 => (First => 5_246, Last => 5_248),
      --  1162: "10月"

      1_162 => (First => 5_249, Last => 5_251),
      --  1163: "10"

      1_163 => (First => 1_570, Last => 1_571),
      --  1164: "1"

      1_164 => (First => 162, Last => 162),
      --  1165: "0"

      1_165 => (First => 161, Last => 161),
      --  1166: "."

      1_166 => (First => 532, Last => 532),
      --  1167: "-"

      1_167 => (First => 521, Last => 521),
      --  1168: ","

      1_168 => (First => 1_592, Last => 1_592),
      --  1169: "+"

      1_169 => (First => 523, Last => 523),
      --  1170: "'kl'. HH:mm:ss zzzz"

      1_170 => (First => 5_252, Last => 5_270),
      --  1171: "%#,##0"

      1_171 => (First => 5_271, Last => 5_276),
      --  1172: "%"

      1_172 => (First => 5_271, Last => 5_271),
      --  1173: "#E0"

      1_173 => (First => 5_277, Last => 5_279),
      --  1174: "#,##0 %"

      1_174 => (First => 5_280, Last => 5_286),
      --  1175: "#,##0.00 ¤;(#,##0.00 ¤)"

      1_175 => (First => 5_287, Last => 5_309),
      --  1176: "#,##0.00 ¤"

      1_176 => (First => 5_287, Last => 5_296),
      --  1177: "#,##0.###"

      1_177 => (First => 5_310, Last => 5_318),
      --  1178: "#,##0%"

      1_178 => (First => 5_319, Last => 5_324),
      --  1179: "#"

      1_179 => (First => 1_591, Last => 1_591));

begin
   return Result;
end String_Addresses;
