--
--  This is a generated file.
--  DO NOT EDIT.
--

separate (ZanyBlue.Text.Locales)
function String_Addresses return String_Addresses_Type is

   Result : constant String_Addresses_Type := (
      --  1: ""
      1 => (First => 1, Last => 0),
      --  2: "൦൧൨൩൪൫൬൭൮൯"
      2 => (First => 1, Last => 10),
      --  3: "༠༡༢༣༤༥༦༧༨༩"
      3 => (First => 11, Last => 20),
      --  4: "꤀꤁꤂꤃꤄꤅꤆꤇꤈꤉"
      4 => (First => 21, Last => 30),
      --  5: "௦௧௨௩௪௫௬௭௮௯"
      5 => (First => 31, Last => 40),
      --  6: "꩐꩑꩒꩓꩔꩕꩖꩗꩘꩙"
      6 => (First => 41, Last => 50),
      --  7: "᪐᪑᪒᪓᪔᪕᪖᪗᪘᪙"
      7 => (First => 51, Last => 60),
      --  8: "০১২৩৪৫৬৭৮৯"
      8 => (First => 61, Last => 70),
      --  9: "᥆᥇᥈᥉᥊᥋᥌᥍᥎᥏"
      9 => (First => 71, Last => 80),
      --  10: "꯰꯱꯲꯳꯴꯵꯶꯷꯸꯹"
      10 => (First => 81, Last => 90),
      --  11: "೦೧೨೩೪೫೬೭೮೯"
      11 => (First => 91, Last => 100),
      --  12: "꧐꧑꧒꧓꧔꧕꧖꧗꧘꧙"
      12 => (First => 101, Last => 110),
      --  13: "੦੧੨੩੪੫੬੭੮੯"
      13 => (First => 111, Last => 120),
      --  14: "୦୧୨୩୪୫୬୭୮୯"
      14 => (First => 121, Last => 130),
      --  15: "໐໑໒໓໔໕໖໗໘໙"
      15 => (First => 131, Last => 140),
      --  16: "០១២៣៤៥៦៧៨៩"
      16 => (First => 141, Last => 150),
      --  17: "᮰᮱᮲᮳᮴᮵᮶᮷᮸᮹"
      17 => (First => 151, Last => 160),
      --  18: "0123456789"
      18 => (First => 161, Last => 170),
      --  19: "᭐᭑᭒᭓᭔᭕᭖᭗᭘᭙"
      19 => (First => 171, Last => 180),
      --  20: "꣐꣑꣒꣓꣔꣕꣖꣗꣘꣙"
      20 => (First => 181, Last => 190),
      --  21: "૦૧૨૩૪૫૬૭૮૯"
      21 => (First => 191, Last => 200),
      --  22: "꘠꘡꘢꘣꘤꘥꘦꘧꘨꘩"
      22 => (First => 201, Last => 210),
      --  23: "٠١٢٣٤٥٦٧٨٩"
      23 => (First => 211, Last => 220),
      --  24: "౦౧౨౩౪౫౬౭౮౯"
      24 => (First => 221, Last => 230),
      --  25: "๐๑๒๓๔๕๖๗๘๙"
      25 => (First => 231, Last => 240),
      --  26: "߀߁߂߃߄߅߆߇߈߉"
      26 => (First => 241, Last => 250),
      --  27: "᱀᱁᱂᱃᱄᱅᱆᱇᱈᱉"
      27 => (First => 251, Last => 260),
      --  28: "᧐᧑᧒᧓᧔᧕᧖᧗᧘᧙"
      28 => (First => 261, Last => 270),
      --  29: "᠐᠑᠒᠓᠔᠕᠖᠗᠘᠙"
      29 => (First => 271, Last => 280),
      --  30: "०१२३४५६७८९"
      30 => (First => 281, Last => 290),
      --  31: "႐႑႒႓႔႕႖႗႘႙"
      31 => (First => 291, Last => 300),
      --  32: "᪀᪁᪂᪃᪄᪅᪆᪇᪈᪉"
      32 => (First => 301, Last => 310),
      --  33: "۰۱۲۳۴۵۶۷۸۹"
      33 => (First => 311, Last => 320),
      --  34: "᱐᱑᱒᱓᱔᱕᱖᱗᱘᱙"
      34 => (First => 321, Last => 330),
      --  35: "〇一二三四五六七八九"
      35 => (First => 331, Last => 340),
      --  36: "၀၁၂၃၄၅၆၇၈၉"
      36 => (First => 341, Last => 350),
      --  37: "０１２３４５６７８９"
      37 => (First => 351, Last => 360),
      --  38: "화요일"
      38 => (First => 361, Last => 363),
      --  39: "화"
      39 => (First => 361, Last => 361),
      --  40: "토요일"
      40 => (First => 364, Last => 366),
      --  41: "토"
      41 => (First => 364, Last => 364),
      --  42: "정오"
      42 => (First => 367, Last => 368),
      --  43: "일요일"
      43 => (First => 369, Last => 371),
      --  44: "일"
      44 => (First => 363, Last => 363),
      --  45: "월요일"
      45 => (First => 372, Last => 374),
      --  46: "월"
      46 => (First => 372, Last => 372),
      --  47: "오후"
      47 => (First => 375, Last => 376),
      --  48: "오전"
      48 => (First => 377, Last => 378),
      --  49: "수요일"
      49 => (First => 379, Last => 381),
      --  50: "수"
      50 => (First => 379, Last => 379),
      --  51: "서기"
      51 => (First => 382, Last => 383),
      --  52: "목요일"
      52 => (First => 384, Last => 386),
      --  53: "목"
      53 => (First => 384, Last => 384),
      --  54: "기원전"
      54 => (First => 387, Last => 389),
      --  55: "금요일"
      55 => (First => 390, Last => 392),
      --  56: "금"
      56 => (First => 390, Last => 390),
      --  57: "非數值"
      57 => (First => 393, Last => 395),
      --  58: "金曜日"
      58 => (First => 396, Last => 398),
      --  59: "金"
      59 => (First => 396, Last => 396),
      --  60: "週日"
      60 => (First => 399, Last => 400),
      --  61: "週四"
      61 => (First => 401, Last => 402),
      --  62: "週六"
      62 => (First => 403, Last => 404),
      --  63: "週五"
      63 => (First => 405, Last => 406),
      --  64: "週二"
      64 => (First => 407, Last => 408),
      --  65: "週三"
      65 => (First => 409, Last => 410),
      --  66: "週一"
      66 => (First => 411, Last => 412),
      --  67: "西暦"
      67 => (First => 413, Last => 414),
      --  68: "西元前"
      68 => (First => 415, Last => 417),
      --  69: "西元"
      69 => (First => 415, Last => 416),
      --  70: "紀元前"
      70 => (First => 418, Last => 420),
      --  71: "火曜日"
      71 => (First => 421, Last => 423),
      --  72: "火"
      72 => (First => 421, Last => 421),
      --  73: "清晨"
      73 => (First => 424, Last => 425),
      --  74: "水曜日"
      74 => (First => 426, Last => 428),
      --  75: "水"
      75 => (First => 426, Last => 426),
      --  76: "正午"
      76 => (First => 429, Last => 430),
      --  77: "木曜日"
      77 => (First => 431, Last => 433),
      --  78: "木"
      78 => (First => 431, Last => 431),
      --  79: "月曜日"
      79 => (First => 434, Last => 436),
      --  80: "月"
      80 => (First => 434, Last => 434),
      --  81: "晚上"
      81 => (First => 437, Last => 438),
      --  82: "星期日"
      82 => (First => 439, Last => 441),
      --  83: "星期四"
      83 => (First => 442, Last => 444),
      --  84: "星期六"
      84 => (First => 445, Last => 447),
      --  85: "星期五"
      85 => (First => 448, Last => 450),
      --  86: "星期二"
      86 => (First => 451, Last => 453),
      --  87: "星期三"
      87 => (First => 454, Last => 456),
      --  88: "星期一"
      88 => (First => 457, Last => 459),
      --  89: "日曜日"
      89 => (First => 460, Last => 462),
      --  90: "日"
      90 => (First => 398, Last => 398),
      --  91: "土曜日"
      91 => (First => 463, Last => 465),
      --  92: "土"
      92 => (First => 463, Last => 463),
      --  93: "四月"
      93 => (First => 466, Last => 467),
      --  94: "周日"
      94 => (First => 468, Last => 469),
      --  95: "周四"
      95 => (First => 470, Last => 471),
      --  96: "周六"
      96 => (First => 472, Last => 473),
      --  97: "周五"
      97 => (First => 474, Last => 475),
      --  98: "周二"
      98 => (First => 476, Last => 477),
      --  99: "周三"
      99 => (First => 478, Last => 479),
      --  100: "周一"
      100 => (First => 480, Last => 481),
      --  101: "午後"
      101 => (First => 482, Last => 483),
      --  102: "午前"
      102 => (First => 484, Last => 485),
      --  103: "十月"
      103 => (First => 486, Last => 487),
      --  104: "十二月"
      104 => (First => 488, Last => 490),
      --  105: "十一月"
      105 => (First => 491, Last => 493),
      --  106: "凌晨"
      106 => (First => 494, Last => 495),
      --  107: "六月"
      107 => (First => 496, Last => 497),
      --  108: "公元前"
      108 => (First => 498, Last => 500),
      --  109: "公元"
      109 => (First => 498, Last => 499),
      --  110: "八月"
      110 => (First => 501, Last => 502),
      --  111: "五月"
      111 => (First => 503, Last => 504),
      --  112: "二月"
      112 => (First => 489, Last => 490),
      --  113: "九月"
      113 => (First => 505, Last => 506),
      --  114: "中午"
      114 => (First => 507, Last => 508),
      --  115: "下午"
      115 => (First => 509, Last => 510),
      --  116: "上午"
      116 => (First => 511, Last => 512),
      --  117: "三月"
      117 => (First => 513, Last => 514),
      --  118: "七月"
      118 => (First => 515, Last => 516),
      --  119: "一月"
      119 => (First => 492, Last => 493),
      --  120: "∞"
      120 => (First => 517, Last => 517),
      --  121: "−"
      121 => (First => 518, Last => 518),
      --  122: "‰"
      122 => (First => 519, Last => 519),
      --  123: "‎-"
      123 => (First => 520, Last => 521),
      --  124: "‎+"
      124 => (First => 522, Last => 523),
      --  125: "เมษายน"
      125 => (First => 524, Last => 529),
      --  126: "เม.ย."
      126 => (First => 530, Last => 534),
      --  127: "เที่ยง"
      127 => (First => 535, Last => 540),
      --  128: "อา."
      128 => (First => 541, Last => 543),
      --  129: "อ."
      129 => (First => 544, Last => 545),
      --  130: "หลังเที่ยง"
      130 => (First => 546, Last => 555),
      --  131: "สิงหาคม"
      131 => (First => 556, Last => 562),
      --  132: "ส.ค."
      132 => (First => 563, Last => 566),
      --  133: "ส."
      133 => (First => 563, Last => 564),
      --  134: "ศ."
      134 => (First => 567, Last => 568),
      --  135: "วันเสาร์"
      135 => (First => 569, Last => 576),
      --  136: "วันอาทิตย์"
      136 => (First => 577, Last => 586),
      --  137: "วันอังคาร"
      137 => (First => 587, Last => 595),
      --  138: "วันศุกร์"
      138 => (First => 596, Last => 603),
      --  139: "วันพุธ"
      139 => (First => 604, Last => 609),
      --  140: "วันพฤหัสบดี"
      140 => (First => 610, Last => 620),
      --  141: "วันจันทร์"
      141 => (First => 621, Last => 629),
      --  142: "มีนาคม"
      142 => (First => 630, Last => 635),
      --  143: "มี.ค."
      143 => (First => 636, Last => 640),
      --  144: "มิถุนายน"
      144 => (First => 641, Last => 648),
      --  145: "มิ.ย."
      145 => (First => 649, Last => 653),
      --  146: "มกราคม"
      146 => (First => 654, Last => 659),
      --  147: "ม.ค."
      147 => (First => 660, Last => 663),
      --  148: "พฤษภาคม"
      148 => (First => 664, Last => 670),
      --  149: "พฤศจิกายน"
      149 => (First => 671, Last => 679),
      --  150: "พฤ."
      150 => (First => 680, Last => 682),
      --  151: "พ.ย."
      151 => (First => 683, Last => 686),
      --  152: "พ.ค."
      152 => (First => 687, Last => 690),
      --  153: "พ."
      153 => (First => 683, Last => 684),
      --  154: "ปีก่อน ค.ศ."
      154 => (First => 691, Last => 701),
      --  155: "ธันวาคม"
      155 => (First => 702, Last => 708),
      --  156: "ธ.ค."
      156 => (First => 709, Last => 712),
      --  157: "ตุลาคม"
      157 => (First => 713, Last => 718),
      --  158: "ต.ค."
      158 => (First => 719, Last => 722),
      --  159: "จ."
      159 => (First => 723, Last => 724),
      --  160: "ค.ศ."
      160 => (First => 565, Last => 568),
      --  161: "ก่อนเที่ยง"
      161 => (First => 725, Last => 734),
      --  162: "กุมภาพันธ์"
      162 => (First => 735, Last => 744),
      --  163: "กันยายน"
      163 => (First => 745, Last => 751),
      --  164: "กรกฎาคม"
      164 => (First => 752, Last => 758),
      --  165: "ก.ย."
      165 => (First => 759, Last => 762),
      --  166: "ก.พ."
      166 => (First => 763, Last => 766),
      --  167: "ก.ค."
      167 => (First => 767, Last => 770),
      --  168: "٠"
      168 => (First => 211, Last => 211),
      --  169: "يونيو"
      169 => (First => 771, Last => 775),
      --  170: "يوليو"
      170 => (First => 776, Last => 780),
      --  171: "يناير"
      171 => (First => 781, Last => 785),
      --  172: "ي"
      172 => (First => 771, Last => 771),
      --  173: "و"
      173 => (First => 772, Last => 772),
      --  174: "نوفمبر"
      174 => (First => 786, Last => 791),
      --  175: "ن"
      175 => (First => 773, Last => 773),
      --  176: "مايو"
      176 => (First => 792, Last => 795),
      --  177: "مارس"
      177 => (First => 796, Last => 799),
      --  178: "م"
      178 => (First => 789, Last => 789),
      --  179: "ل"
      179 => (First => 778, Last => 778),
      --  180: "ك"
      180 => (First => 800, Last => 800),
      --  181: "ق.م"
      181 => (First => 801, Last => 803),
      --  182: "فبراير"
      182 => (First => 804, Last => 809),
      --  183: "ف"
      183 => (First => 788, Last => 788),
      --  184: "غ"
      184 => (First => 810, Last => 810),
      --  185: "ظ"
      185 => (First => 811, Last => 811),
      --  186: "ص"
      186 => (First => 812, Last => 812),
      --  187: "سبتمبر"
      187 => (First => 813, Last => 818),
      --  188: "س"
      188 => (First => 799, Last => 799),
      --  189: "ديسمبر"
      189 => (First => 819, Last => 824),
      --  190: "د"
      190 => (First => 819, Last => 819),
      --  191: "ب"
      191 => (First => 790, Last => 790),
      --  192: "السبت"
      192 => (First => 825, Last => 829),
      --  193: "الخميس"
      193 => (First => 830, Last => 835),
      --  194: "الجمعة"
      194 => (First => 836, Last => 841),
      --  195: "الثلاثاء"
      195 => (First => 842, Last => 849),
      --  196: "الاثنين"
      196 => (First => 850, Last => 856),
      --  197: "الأربعاء"
      197 => (First => 857, Last => 864),
      --  198: "الأحد"
      198 => (First => 865, Last => 869),
      --  199: "أكتوبر"
      199 => (First => 870, Last => 875),
      --  200: "أغسطس"
      200 => (First => 876, Last => 880),
      --  201: "أبريل"
      201 => (First => 881, Last => 885),
      --  202: "أ"
      202 => (First => 859, Last => 859),
      --  203: "שבת"
      203 => (First => 886, Last => 888),
      --  204: "פבר׳"
      204 => (First => 889, Last => 892),
      --  205: "פברואר"
      205 => (First => 893, Last => 898),
      --  206: "ספט׳"
      206 => (First => 899, Last => 902),
      --  207: "ספטמבר"
      207 => (First => 903, Last => 908),
      --  208: "נוב׳"
      208 => (First => 909, Last => 912),
      --  209: "נובמבר"
      209 => (First => 913, Last => 918),
      --  210: "מרץ"
      210 => (First => 919, Last => 921),
      --  211: "מאי"
      211 => (First => 922, Last => 924),
      --  212: "לפנה״צ"
      212 => (First => 925, Last => 930),
      --  213: "לפנה״ס"
      213 => (First => 931, Last => 936),
      --  214: "לספירה"
      214 => (First => 937, Last => 942),
      --  215: "ינו׳"
      215 => (First => 943, Last => 946),
      --  216: "ינואר"
      216 => (First => 947, Last => 951),
      --  217: "יוני"
      217 => (First => 952, Last => 955),
      --  218: "יום שני"
      218 => (First => 956, Last => 962),
      --  219: "יום שלישי"
      219 => (First => 963, Last => 971),
      --  220: "יום שישי"
      220 => (First => 972, Last => 979),
      --  221: "יום שבת"
      221 => (First => 980, Last => 986),
      --  222: "יום רביעי"
      222 => (First => 987, Last => 995),
      --  223: "יום ראשון"
      223 => (First => 996, Last => 1004),
      --  224: "יום חמישי"
      224 => (First => 1005, Last => 1013),
      --  225: "יום ו׳"
      225 => (First => 1014, Last => 1019),
      --  226: "יום ה׳"
      226 => (First => 1020, Last => 1025),
      --  227: "יום ד׳"
      227 => (First => 1026, Last => 1031),
      --  228: "יום ג׳"
      228 => (First => 1032, Last => 1037),
      --  229: "יום ב׳"
      229 => (First => 1038, Last => 1043),
      --  230: "יום א׳"
      230 => (First => 1044, Last => 1049),
      --  231: "יולי"
      231 => (First => 1050, Last => 1053),
      --  232: "דצמ׳"
      232 => (First => 1054, Last => 1057),
      --  233: "דצמבר"
      233 => (First => 1058, Last => 1062),
      --  234: "בצהריים"
      234 => (First => 1063, Last => 1069),
      --  235: "אפר׳"
      235 => (First => 1070, Last => 1073),
      --  236: "אפריל"
      236 => (First => 1074, Last => 1078),
      --  237: "אחה״צ"
      237 => (First => 1079, Last => 1083),
      --  238: "אוק׳"
      238 => (First => 1084, Last => 1087),
      --  239: "אוקטובר"
      239 => (First => 1088, Last => 1094),
      --  240: "אוג׳"
      240 => (First => 1095, Last => 1098),
      --  241: "אוגוסט"
      241 => (First => 1099, Last => 1104),
      --  242: "января"
      242 => (First => 1105, Last => 1110),
      --  243: "янв."
      243 => (First => 1111, Last => 1114),
      --  244: "чт"
      244 => (First => 1115, Last => 1116),
      --  245: "четверг"
      245 => (First => 1117, Last => 1123),
      --  246: "февраля"
      246 => (First => 1124, Last => 1130),
      --  247: "февр."
      247 => (First => 1131, Last => 1135),
      --  248: "суббота"
      248 => (First => 1136, Last => 1142),
      --  249: "среда"
      249 => (First => 1143, Last => 1147),
      --  250: "ср"
      250 => (First => 1143, Last => 1144),
      --  251: "сентября"
      251 => (First => 1148, Last => 1155),
      --  252: "сент."
      252 => (First => 1156, Last => 1160),
      --  253: "сб"
      253 => (First => 1161, Last => 1162),
      --  254: "пятница"
      254 => (First => 1163, Last => 1169),
      --  255: "пт"
      255 => (First => 1170, Last => 1171),
      --  256: "понедельник"
      256 => (First => 1172, Last => 1182),
      --  257: "полдень"
      257 => (First => 1183, Last => 1189),
      --  258: "пн"
      258 => (First => 1190, Last => 1191),
      --  259: "октября"
      259 => (First => 1192, Last => 1198),
      --  260: "окт."
      260 => (First => 1199, Last => 1202),
      --  261: "ноября"
      261 => (First => 1203, Last => 1208),
      --  262: "нояб."
      262 => (First => 1209, Last => 1213),
      --  263: "не число"
      263 => (First => 1214, Last => 1221),
      --  264: "н. э."
      264 => (First => 1222, Last => 1226),
      --  265: "мая"
      265 => (First => 1227, Last => 1229),
      --  266: "марта"
      266 => (First => 1230, Last => 1234),
      --  267: "июня"
      267 => (First => 1235, Last => 1238),
      --  268: "июля"
      268 => (First => 1239, Last => 1242),
      --  269: "до н. э."
      269 => (First => 1243, Last => 1250),
      --  270: "декабря"
      270 => (First => 1251, Last => 1257),
      --  271: "дек."
      271 => (First => 1258, Last => 1261),
      --  272: "вторник"
      272 => (First => 1262, Last => 1268),
      --  273: "вт"
      273 => (First => 1262, Last => 1263),
      --  274: "вс"
      274 => (First => 1269, Last => 1270),
      --  275: "воскресенье"
      275 => (First => 1271, Last => 1281),
      --  276: "апреля"
      276 => (First => 1282, Last => 1287),
      --  277: "апр."
      277 => (First => 1288, Last => 1291),
      --  278: "августа"
      278 => (First => 1292, Last => 1298),
      --  279: "авг."
      279 => (First => 1299, Last => 1302),
      --  280: "Я"
      280 => (First => 1303, Last => 1303),
      --  281: "Ф"
      281 => (First => 1304, Last => 1304),
      --  282: "С"
      282 => (First => 1305, Last => 1305),
      --  283: "О"
      283 => (First => 1306, Last => 1306),
      --  284: "Н"
      284 => (First => 1307, Last => 1307),
      --  285: "М"
      285 => (First => 1308, Last => 1308),
      --  286: "И"
      286 => (First => 1309, Last => 1309),
      --  287: "Д"
      287 => (First => 1310, Last => 1310),
      --  288: "А"
      288 => (First => 1311, Last => 1311),
      --  289: "π.μ."
      289 => (First => 1312, Last => 1315),
      --  290: "π.Χ."
      290 => (First => 1316, Last => 1319),
      --  291: "μεσημέρι"
      291 => (First => 1320, Last => 1327),
      --  292: "μ.μ."
      292 => (First => 1328, Last => 1331),
      --  293: "μ.Χ."
      293 => (First => 1332, Last => 1335),
      --  294: "Φεβρουαρίου"
      294 => (First => 1336, Last => 1346),
      --  295: "Φεβ"
      295 => (First => 1336, Last => 1338),
      --  296: "Φ"
      296 => (First => 1336, Last => 1336),
      --  297: "Τρίτη"
      297 => (First => 1347, Last => 1351),
      --  298: "Τρί"
      298 => (First => 1347, Last => 1349),
      --  299: "Τετάρτη"
      299 => (First => 1352, Last => 1358),
      --  300: "Τετ"
      300 => (First => 1352, Last => 1354),
      --  301: "Σεπτεμβρίου"
      301 => (First => 1359, Last => 1369),
      --  302: "Σεπ"
      302 => (First => 1359, Last => 1361),
      --  303: "Σάββατο"
      303 => (First => 1370, Last => 1376),
      --  304: "Σάβ"
      304 => (First => 1370, Last => 1372),
      --  305: "Σ"
      305 => (First => 1359, Last => 1359),
      --  306: "Παρασκευή"
      306 => (First => 1377, Last => 1385),
      --  307: "Παρ"
      307 => (First => 1377, Last => 1379),
      --  308: "Πέμπτη"
      308 => (First => 1386, Last => 1391),
      --  309: "Πέμ"
      309 => (First => 1386, Last => 1388),
      --  310: "Οκτωβρίου"
      310 => (First => 1392, Last => 1400),
      --  311: "Οκτ"
      311 => (First => 1392, Last => 1394),
      --  312: "Ο"
      312 => (First => 1392, Last => 1392),
      --  313: "Νοεμβρίου"
      313 => (First => 1401, Last => 1409),
      --  314: "Νοε"
      314 => (First => 1401, Last => 1403),
      --  315: "Ν"
      315 => (First => 1401, Last => 1401),
      --  316: "Μαρτίου"
      316 => (First => 1410, Last => 1416),
      --  317: "Μαρ"
      317 => (First => 1410, Last => 1412),
      --  318: "Μαΐου"
      318 => (First => 1417, Last => 1421),
      --  319: "Μαΐ"
      319 => (First => 1417, Last => 1419),
      --  320: "Μ"
      320 => (First => 1410, Last => 1410),
      --  321: "Κυριακή"
      321 => (First => 1422, Last => 1428),
      --  322: "Κυρ"
      322 => (First => 1422, Last => 1424),
      --  323: "Ιουνίου"
      323 => (First => 1429, Last => 1435),
      --  324: "Ιουν"
      324 => (First => 1429, Last => 1432),
      --  325: "Ιουλίου"
      325 => (First => 1436, Last => 1442),
      --  326: "Ιουλ"
      326 => (First => 1436, Last => 1439),
      --  327: "Ιανουαρίου"
      327 => (First => 1443, Last => 1452),
      --  328: "Ιαν"
      328 => (First => 1443, Last => 1445),
      --  329: "Ι"
      329 => (First => 1429, Last => 1429),
      --  330: "Δευτέρα"
      330 => (First => 1453, Last => 1459),
      --  331: "Δευ"
      331 => (First => 1453, Last => 1455),
      --  332: "Δεκεμβρίου"
      332 => (First => 1460, Last => 1469),
      --  333: "Δεκ"
      333 => (First => 1460, Last => 1462),
      --  334: "Δ"
      334 => (First => 1453, Last => 1453),
      --  335: "Αυγούστου"
      335 => (First => 1470, Last => 1478),
      --  336: "Αυγ"
      336 => (First => 1470, Last => 1472),
      --  337: "Απριλίου"
      337 => (First => 1479, Last => 1486),
      --  338: "Απρ"
      338 => (First => 1479, Last => 1481),
      --  339: "Α"
      339 => (First => 1470, Last => 1470),
      --  340: "štvrtok"
      340 => (First => 1487, Last => 1493),
      --  341: "št"
      341 => (First => 1487, Last => 1488),
      --  342: "Şubat"
      342 => (First => 1494, Last => 1498),
      --  343: "Şub"
      343 => (First => 1494, Last => 1496),
      --  344: "Ş"
      344 => (First => 1494, Last => 1494),
      --  345: "środa"
      345 => (First => 1499, Last => 1503),
      --  346: "śr."
      346 => (First => 1504, Last => 1506),
      --  347: "října"
      347 => (First => 1507, Last => 1511),
      --  348: "říj"
      348 => (First => 1507, Last => 1509),
      --  349: "čvn"
      349 => (First => 1512, Last => 1514),
      --  350: "čvc"
      350 => (First => 1515, Last => 1517),
      --  351: "čtvrtek"
      351 => (First => 1518, Last => 1524),
      --  352: "čt"
      352 => (First => 1518, Last => 1519),
      --  353: "června"
      353 => (First => 1525, Last => 1530),
      --  354: "července"
      354 => (First => 1531, Last => 1538),
      --  355: "úterý"
      355 => (First => 1539, Last => 1543),
      --  356: "út"
      356 => (First => 1539, Last => 1540),
      --  357: "února"
      357 => (First => 1544, Last => 1548),
      --  358: "úno"
      358 => (First => 1544, Last => 1546),
      --  359: "öğle"
      359 => (First => 1549, Last => 1552),
      --  360: "î.Hr."
      360 => (First => 1553, Last => 1557),
      --  361: "április"
      361 => (First => 1558, Last => 1564),
      --  362: "ápr."
      362 => (First => 1565, Last => 1568),
      --  363: "×10^"
      363 => (First => 1569, Last => 1572),
      --  364: "ÖÖ"
      364 => (First => 1573, Last => 1574),
      --  365: "ÖS"
      365 => (First => 1575, Last => 1576),
      --  366: "Çarşamba"
      366 => (First => 1577, Last => 1584),
      --  367: "Çar"
      367 => (First => 1577, Last => 1579),
      --  368: "Á"
      368 => (First => 1585, Last => 1585),
      --  369: "¤¤¤"
      369 => (First => 1586, Last => 1588),
      --  370: "¤ #,##0.00;(¤ #,##0.00)"
      370 => (First => 1589, Last => 1611),
      --  371: "¤ #,##0.00"
      371 => (First => 1589, Last => 1598),
      --  372: "¤#,##0.00;(¤#,##0.00)"
      372 => (First => 1612, Last => 1632),
      --  373: " "
      373 => (First => 1216, Last => 1216),
      --  374: "{1}, {0}"
      374 => (First => 1633, Last => 1640),
      --  375: "{1} בשעה {0}"
      375 => (First => 1641, Last => 1652),
      --  376: "{1} {0}"
      376 => (First => 1653, Last => 1659),
      --  377: "{1} - {0}"
      377 => (First => 1660, Last => 1668),
      --  378: "{1} 'um' {0}"
      378 => (First => 1669, Last => 1680),
      --  379: "{1} 'kl.' {0}"
      379 => (First => 1681, Last => 1693),
      --  380: "{1} 'at' {0}"
      380 => (First => 1694, Last => 1705),
      --  381: "září"
      381 => (First => 1706, Last => 1709),
      --  382: "zář"
      382 => (First => 1706, Last => 1708),
      --  383: "zzzzah:mm:ss"
      383 => (First => 1710, Last => 1721),
      --  384: "zondag"
      384 => (First => 1722, Last => 1727),
      --  385: "zo"
      385 => (First => 1722, Last => 1723),
      --  386: "zh_Hant"
      386 => (First => 1728, Last => 1734),
      --  387: "zh"
      387 => (First => 1728, Last => 1729),
      --  388: "zaterdag"
      388 => (First => 1735, Last => 1742),
      --  389: "zah:mm:ss"
      389 => (First => 1713, Last => 1721),
      --  390: "za"
      390 => (First => 1713, Last => 1714),
      --  391: "y년 M월 d일 EEEE"
      391 => (First => 1743, Last => 1755),
      --  392: "y년 M월 d일"
      392 => (First => 1743, Last => 1750),
      --  393: "y年M月d日EEEE"
      393 => (First => 1756, Last => 1765),
      --  394: "y年M月d日 EEEE"
      394 => (First => 1766, Last => 1776),
      --  395: "y年M月d日"
      395 => (First => 1756, Last => 1761),
      --  396: "yy/M/d"
      396 => (First => 1777, Last => 1782),
      --  397: "yy. M. d."
      397 => (First => 1783, Last => 1791),
      --  398: "y/MM/dd"
      398 => (First => 1792, Last => 1798),
      --  399: "y/M/d"
      399 => (First => 1778, Last => 1782),
      --  400: "y. MMMM d., EEEE"
      400 => (First => 1799, Last => 1814),
      --  401: "y. MMMM d."
      401 => (First => 1799, Last => 1808),
      --  402: "y. MMM d."
      402 => (First => 1815, Last => 1823),
      --  403: "y. MM. dd."
      403 => (First => 1824, Last => 1833),
      --  404: "y. M. d."
      404 => (First => 1784, Last => 1791),
      --  405: "y-MM-dd"
      405 => (First => 1834, Last => 1840),
      --  406: "wtorek"
      406 => (First => 1841, Last => 1846),
      --  407: "wt."
      407 => (First => 1847, Last => 1849),
      --  408: "września"
      408 => (First => 1850, Last => 1857),
      --  409: "wrz"
      409 => (First => 1850, Last => 1852),
      --  410: "woensdag"
      410 => (First => 1858, Last => 1865),
      --  411: "wo"
      411 => (First => 1858, Last => 1859),
      --  412: "wieczorem"
      412 => (First => 1866, Last => 1874),
      --  413: "weeHours"
      413 => (First => 1875, Last => 1882),
      --  414: "w południe"
      414 => (First => 1883, Last => 1892),
      --  415: "w nocy"
      415 => (First => 1893, Last => 1898),
      --  416: "w"
      416 => (First => 1841, Last => 1841),
      --  417: "vrijdag"
      417 => (First => 1899, Last => 1905),
      --  418: "vr"
      418 => (First => 1489, Last => 1490),
      --  419: "vormittags"
      419 => (First => 1906, Last => 1915),
      --  420: "vorm."
      420 => (First => 1916, Last => 1920),
      --  421: "vineri"
      421 => (First => 1921, Last => 1926),
      --  422: "viernes"
      422 => (First => 1927, Last => 1933),
      --  423: "vie."
      423 => (First => 1934, Last => 1937),
      --  424: "venerdì"
      424 => (First => 1938, Last => 1944),
      --  425: "vendredi"
      425 => (First => 1945, Last => 1952),
      --  426: "ven."
      426 => (First => 1953, Last => 1956),
      --  427: "ven"
      427 => (First => 1534, Last => 1536),
      --  428: "vasárnap"
      428 => (First => 1957, Last => 1964),
      --  429: "v.Chr."
      429 => (First => 1965, Last => 1970),
      --  430: "v. Chr."
      430 => (First => 1971, Last => 1977),
      --  431: "utorok"
      431 => (First => 1978, Last => 1983),
      --  432: "ut"
      432 => (First => 1978, Last => 1979),
      --  433: "tr"
      433 => (First => 1984, Last => 1985),
      --  434: "toukokuuta"
      434 => (First => 1986, Last => 1995),
      --  435: "torstaina"
      435 => (First => 1996, Last => 2004),
      --  436: "torsdag"
      436 => (First => 2005, Last => 2011),
      --  437: "tors"
      437 => (First => 1996, Last => 1999),
      --  438: "tor."
      438 => (First => 2012, Last => 2015),
      --  439: "to"
      439 => (First => 1491, Last => 1492),
      --  440: "tisdag"
      440 => (First => 2016, Last => 2021),
      --  441: "tis"
      441 => (First => 2016, Last => 2018),
      --  442: "tirsdag"
      442 => (First => 2022, Last => 2028),
      --  443: "tir."
      443 => (First => 2029, Last => 2032),
      --  444: "tiistaina"
      444 => (First => 2033, Last => 2041),
      --  445: "ti"
      445 => (First => 2016, Last => 2017),
      --  446: "th"
      446 => (First => 2042, Last => 2043),
      --  447: "terça-feira"
      447 => (First => 2044, Last => 2054),
      --  448: "ter"
      448 => (First => 1540, Last => 1542),
      --  449: "tarde"
      449 => (First => 2055, Last => 2059),
      --  450: "tammikuuta"
      450 => (First => 2060, Last => 2069),
      --  451: "søndag"
      451 => (First => 2070, Last => 2075),
      --  452: "søn."
      452 => (First => 2076, Last => 2079),
      --  453: "söndag"
      453 => (First => 2080, Last => 2085),
      --  454: "sön"
      454 => (First => 2080, Last => 2082),
      --  455: "sâmbătă"
      455 => (First => 2086, Last => 2092),
      --  456: "sábado"
      456 => (First => 2093, Last => 2098),
      --  457: "sáb."
      457 => (First => 2099, Last => 2102),
      --  458: "sáb"
      458 => (First => 2093, Last => 2095),
      --  459: "szombat"
      459 => (First => 2103, Last => 2109),
      --  460: "szerda"
      460 => (First => 2110, Last => 2115),
      --  461: "szeptember"
      461 => (First => 2116, Last => 2125),
      --  462: "szept."
      462 => (First => 2126, Last => 2131),
      --  463: "syyskuuta"
      463 => (First => 2132, Last => 2140),
      --  464: "sv"
      464 => (First => 1915, Last => 1916),
      --  465: "sunnuntaina"
      465 => (First => 2141, Last => 2151),
      --  466: "su"
      466 => (First => 2141, Last => 2142),
      --  467: "středa"
      467 => (First => 2152, Last => 2157),
      --  468: "stycznia"
      468 => (First => 2158, Last => 2165),
      --  469: "sty"
      469 => (First => 2158, Last => 2160),
      --  470: "streda"
      470 => (First => 2166, Last => 2171),
      --  471: "st"
      471 => (First => 1999, Last => 2000),
      --  472: "srpna"
      472 => (First => 2172, Last => 2176),
      --  473: "srp"
      473 => (First => 2172, Last => 2174),
      --  474: "soir"
      474 => (First => 2177, Last => 2180),
      --  475: "sobota"
      475 => (First => 2181, Last => 2186),
      --  476: "sob."
      476 => (First => 2187, Last => 2190),
      --  477: "so"
      477 => (First => 2177, Last => 2178),
      --  478: "sk"
      478 => (First => 2135, Last => 2136),
      --  479: "sierpnia"
      479 => (First => 2191, Last => 2198),
      --  480: "sie"
      480 => (First => 2191, Last => 2193),
      --  481: "sexta-feira"
      481 => (First => 2199, Last => 2209),
      --  482: "sex"
      482 => (First => 2199, Last => 2201),
      --  483: "settembre"
      483 => (First => 2210, Last => 2218),
      --  484: "setembro"
      484 => (First => 2219, Last => 2226),
      --  485: "set"
      485 => (First => 2210, Last => 2212),
      --  486: "septiembre"
      486 => (First => 2227, Last => 2236),
      --  487: "septembrie"
      487 => (First => 2237, Last => 2246),
      --  488: "septembre"
      488 => (First => 2247, Last => 2255),
      --  489: "septembra"
      489 => (First => 2256, Last => 2264),
      --  490: "september"
      490 => (First => 2265, Last => 2273),
      --  491: "sept."
      491 => (First => 2274, Last => 2278),
      --  492: "sep."
      492 => (First => 2279, Last => 2282),
      --  493: "sep"
      493 => (First => 2227, Last => 2229),
      --  494: "segunda-feira"
      494 => (First => 2283, Last => 2295),
      --  495: "seg"
      495 => (First => 2283, Last => 2285),
      --  496: "samedi"
      496 => (First => 2296, Last => 2301),
      --  497: "sam."
      497 => (First => 2302, Last => 2305),
      --  498: "sabato"
      498 => (First => 2306, Last => 2311),
      --  499: "sab"
      499 => (First => 2306, Last => 2308),
      --  500: "s"
      500 => (First => 1564, Last => 1564),
      --  501: "ru"
      501 => (First => 2312, Last => 2313),
      --  502: "ro"
      502 => (First => 1500, Last => 1501),
      --  503: "right-to-left"
      503 => (First => 2314, Last => 2326),
      --  504: "rano"
      504 => (First => 2327, Last => 2330),
      --  505: "quinta-feira"
      505 => (First => 2331, Last => 2342),
      --  506: "qui"
      506 => (First => 2331, Last => 2333),
      --  507: "quarta-feira"
      507 => (First => 2343, Last => 2354),
      --  508: "qua"
      508 => (First => 2343, Last => 2345),
      --  509: "př. n. l."
      509 => (First => 2355, Last => 2363),
      --  510: "péntek"
      510 => (First => 2364, Last => 2369),
      --  511: "på dagen"
      511 => (First => 2370, Last => 2377),
      --  512: "pátek"
      512 => (First => 2378, Last => 2382),
      --  513: "pá"
      513 => (First => 2378, Last => 2379),
      --  514: "pt."
      514 => (First => 2129, Last => 2131),
      --  515: "pt"
      515 => (First => 2119, Last => 2120),
      --  516: "przed południem"
      516 => (First => 2383, Last => 2397),
      --  517: "prosince"
      517 => (First => 2398, Last => 2405),
      --  518: "pro"
      518 => (First => 2398, Last => 2400),
      --  519: "pred Kr."
      519 => (First => 2406, Last => 2413),
      --  520: "poniedziałek"
      520 => (First => 2414, Last => 2425),
      --  521: "pondělí"
      521 => (First => 2426, Last => 2432),
      --  522: "pondelok"
      522 => (First => 2433, Last => 2440),
      --  523: "pon."
      523 => (First => 2441, Last => 2444),
      --  524: "poludnie"
      524 => (First => 2445, Last => 2452),
      --  525: "poledne"
      525 => (First => 2453, Last => 2459),
      --  526: "po południu"
      526 => (First => 2460, Last => 2470),
      --  527: "po Kr."
      527 => (First => 2471, Last => 2476),
      --  528: "po"
      528 => (First => 1885, Last => 1886),
      --  529: "pm"
      529 => (First => 2477, Last => 2478),
      --  530: "pl"
      530 => (First => 2479, Last => 2480),
      --  531: "piątek"
      531 => (First => 2481, Last => 2486),
      --  532: "piatok"
      532 => (First => 2487, Last => 2492),
      --  533: "pi"
      533 => (First => 2481, Last => 2482),
      --  534: "perjantaina"
      534 => (First => 2493, Last => 2503),
      --  535: "pe"
      535 => (First => 2493, Last => 2494),
      --  536: "października"
      536 => (First => 2504, Last => 2515),
      --  537: "paź"
      537 => (First => 2504, Last => 2506),
      --  538: "p.n.e."
      538 => (First => 2516, Last => 2521),
      --  539: "p.m."
      539 => (First => 2522, Last => 2525),
      --  540: "p. m."
      540 => (First => 2526, Last => 2530),
      --  541: "p"
      541 => (First => 1559, Last => 1559),
      --  542: "outubro"
      542 => (First => 2531, Last => 2537),
      --  543: "out"
      543 => (First => 2531, Last => 2533),
      --  544: "ottobre"
      544 => (First => 2538, Last => 2544),
      --  545: "ott"
      545 => (First => 2538, Last => 2540),
      --  546: "onsdag"
      546 => (First => 2545, Last => 2550),
      --  547: "ons."
      547 => (First => 2551, Last => 2554),
      --  548: "ons"
      548 => (First => 2545, Last => 2547),
      --  549: "októbra"
      549 => (First => 2555, Last => 2561),
      --  550: "október"
      550 => (First => 2562, Last => 2568),
      --  551: "oktober"
      551 => (First => 2569, Last => 2575),
      --  552: "okt."
      552 => (First => 2576, Last => 2579),
      --  553: "okt"
      553 => (First => 1982, Last => 1984),
      --  554: "odpoludnia"
      554 => (First => 2580, Last => 2589),
      --  555: "octubre"
      555 => (First => 2590, Last => 2596),
      --  556: "octombrie"
      556 => (First => 2597, Last => 2605),
      --  557: "octobre"
      557 => (First => 2606, Last => 2612),
      --  558: "oct."
      558 => (First => 2613, Last => 2616),
      --  559: "o"
      559 => (First => 1492, Last => 1492),
      --  560: "noviembre"
      560 => (First => 2617, Last => 2625),
      --  561: "novembro"
      561 => (First => 2626, Last => 2633),
      --  562: "novembre"
      562 => (First => 2634, Last => 2641),
      --  563: "novembra"
      563 => (First => 2642, Last => 2649),
      --  564: "november"
      564 => (First => 2650, Last => 2657),
      --  565: "nov."
      565 => (First => 2658, Last => 2661),
      --  566: "nov"
      566 => (First => 2617, Last => 2619),
      --  567: "noon"
      567 => (First => 2662, Last => 2665),
      --  568: "noite"
      568 => (First => 2666, Last => 2670),
      --  569: "noiembrie"
      569 => (First => 2671, Last => 2679),
      --  570: "nl"
      570 => (First => 2680, Last => 2681),
      --  571: "night"
      571 => (First => 2682, Last => 2686),
      --  572: "niedziela"
      572 => (First => 2687, Last => 2695),
      --  573: "niedz."
      573 => (First => 2696, Last => 2701),
      --  574: "neděle"
      574 => (First => 2702, Last => 2707),
      --  575: "nedeľa"
      575 => (First => 2708, Last => 2713),
      --  576: "ne"
      576 => (First => 1923, Last => 1924),
      --  577: "nb"
      577 => (First => 2714, Last => 2715),
      --  578: "nad ranem"
      578 => (First => 2716, Last => 2724),
      --  579: "nachts"
      579 => (First => 2725, Last => 2730),
      --  580: "nachmittags"
      580 => (First => 2731, Last => 2741),
      --  581: "nachm."
      581 => (First => 2742, Last => 2747),
      --  582: "n.e."
      582 => (First => 2518, Last => 2521),
      --  583: "n.Chr."
      583 => (First => 2748, Last => 2753),
      --  584: "n. l."
      584 => (First => 2359, Last => 2363),
      --  585: "n. Chr."
      585 => (First => 2754, Last => 2760),
      --  586: "n"
      586 => (First => 1510, Last => 1510),
      --  587: "måndag"
      587 => (First => 2761, Last => 2766),
      --  588: "mån"
      588 => (First => 2761, Last => 2763),
      --  589: "március"
      589 => (First => 2767, Last => 2773),
      --  590: "márc."
      590 => (First => 2774, Last => 2778),
      --  591: "május"
      591 => (First => 2779, Last => 2783),
      --  592: "mája"
      592 => (First => 2784, Last => 2787),
      --  593: "máj."
      593 => (First => 2788, Last => 2791),
      --  594: "máj"
      594 => (First => 2779, Last => 2781),
      --  595: "mrt."
      595 => (First => 2792, Last => 2795),
      --  596: "morning"
      596 => (First => 2796, Last => 2802),
      --  597: "morgens"
      597 => (First => 2803, Last => 2809),
      --  598: "miércoles"
      598 => (First => 2810, Last => 2818),
      --  599: "mié."
      599 => (First => 2819, Last => 2822),
      --  600: "miercuri"
      600 => (First => 2823, Last => 2830),
      --  601: "midi"
      601 => (First => 2831, Last => 2834),
      --  602: "middag"
      602 => (First => 2835, Last => 2840),
      --  603: "midDay"
      603 => (First => 2841, Last => 2846),
      --  604: "meán lae"
      604 => (First => 2847, Last => 2854),
      --  605: "mezzogiorno"
      605 => (First => 2855, Last => 2865),
      --  606: "mercredi"
      606 => (First => 2866, Last => 2873),
      --  607: "mercoledì"
      607 => (First => 2874, Last => 2882),
      --  608: "mer."
      608 => (First => 2883, Last => 2886),
      --  609: "mer"
      609 => (First => 2866, Last => 2868),
      --  610: "meio-dia"
      610 => (First => 2887, Last => 2894),
      --  611: "mei"
      611 => (First => 2887, Last => 2889),
      --  612: "mediodía"
      612 => (First => 2895, Last => 2902),
      --  613: "mayo"
      613 => (First => 2903, Last => 2906),
      --  614: "may."
      614 => (First => 2907, Last => 2910),
      --  615: "matin"
      615 => (First => 2911, Last => 2915),
      --  616: "marți"
      616 => (First => 2916, Last => 2920),
      --  617: "março"
      617 => (First => 2921, Last => 2925),
      --  618: "marzo"
      618 => (First => 2926, Last => 2930),
      --  619: "marts"
      619 => (First => 2931, Last => 2935),
      --  620: "martie"
      620 => (First => 2936, Last => 2941),
      --  621: "martes"
      621 => (First => 2942, Last => 2947),
      --  622: "martedì"
      622 => (First => 2948, Last => 2954),
      --  623: "mars"
      623 => (First => 2955, Last => 2958),
      --  624: "marraskuuta"
      624 => (First => 2959, Last => 2969),
      --  625: "mardi"
      625 => (First => 2970, Last => 2974),
      --  626: "marca"
      626 => (First => 2975, Last => 2979),
      --  627: "mar."
      627 => (First => 2980, Last => 2983),
      --  628: "mar"
      628 => (First => 2916, Last => 2918),
      --  629: "manhã"
      629 => (First => 2984, Last => 2988),
      --  630: "mandag"
      630 => (First => 2989, Last => 2994),
      --  631: "man."
      631 => (First => 2995, Last => 2998),
      --  632: "maja"
      632 => (First => 2999, Last => 3002),
      --  633: "maj"
      633 => (First => 2999, Last => 3001),
      --  634: "maio"
      634 => (First => 3003, Last => 3006),
      --  635: "mai"
      635 => (First => 3003, Last => 3005),
      --  636: "maggio"
      636 => (First => 3007, Last => 3012),
      --  637: "mag"
      637 => (First => 3007, Last => 3009),
      --  638: "maart"
      638 => (First => 3013, Last => 3017),
      --  639: "maandag"
      639 => (First => 3018, Last => 3024),
      --  640: "maanantaina"
      640 => (First => 3025, Last => 3035),
      --  641: "maaliskuuta"
      641 => (First => 3036, Last => 3046),
      --  642: "ma"
      642 => (First => 2903, Last => 2904),
      --  643: "m"
      643 => (First => 1582, Last => 1582),
      --  644: "lørdag"
      644 => (First => 3047, Last => 3052),
      --  645: "lør."
      645 => (First => 3053, Last => 3056),
      --  646: "lördag"
      646 => (First => 3057, Last => 3062),
      --  647: "lör"
      647 => (First => 3057, Last => 3059),
      --  648: "lutego"
      648 => (First => 3063, Last => 3068),
      --  649: "lut"
      649 => (First => 3063, Last => 3065),
      --  650: "luni"
      650 => (First => 3069, Last => 3072),
      --  651: "lunes"
      651 => (First => 3073, Last => 3077),
      --  652: "lunedì"
      652 => (First => 3078, Last => 3083),
      --  653: "lundi"
      653 => (First => 3084, Last => 3088),
      --  654: "lun."
      654 => (First => 3089, Last => 3092),
      --  655: "lun"
      655 => (First => 3069, Last => 3071),
      --  656: "luglio"
      656 => (First => 3093, Last => 3098),
      --  657: "lug"
      657 => (First => 3093, Last => 3095),
      --  658: "lokakuuta"
      658 => (First => 3099, Last => 3107),
      --  659: "listopadu"
      659 => (First => 3108, Last => 3116),
      --  660: "listopada"
      660 => (First => 3117, Last => 3125),
      --  661: "lis"
      661 => (First => 1562, Last => 1564),
      --  662: "lipca"
      662 => (First => 3126, Last => 3130),
      --  663: "lip"
      663 => (First => 3126, Last => 3128),
      --  664: "left-to-right"
      664 => (First => 3131, Last => 3143),
      --  665: "ledna"
      665 => (First => 3144, Last => 3148),
      --  666: "led"
      666 => (First => 2455, Last => 2457),
      --  667: "lauantaina"
      667 => (First => 3149, Last => 3158),
      --  668: "latn"
      668 => (First => 3159, Last => 3162),
      --  669: "lateMorning"
      669 => (First => 3163, Last => 3173),
      --  670: "la prânz"
      670 => (First => 3174, Last => 3181),
      --  671: "la"
      671 => (First => 2694, Last => 2695),
      --  672: "l"
      672 => (First => 1551, Last => 1551),
      --  673: "kwietnia"
      673 => (First => 3182, Last => 3189),
      --  674: "kwi"
      674 => (First => 3182, Last => 3184),
      --  675: "května"
      675 => (First => 3190, Last => 3195),
      --  676: "kvě"
      676 => (First => 3190, Last => 3192),
      --  677: "ko"
      677 => (First => 1989, Last => 1990),
      --  678: "kl. 12"
      678 => (First => 3196, Last => 3201),
      --  679: "kesäkuuta"
      679 => (First => 3202, Last => 3210),
      --  680: "keskiviikkona"
      680 => (First => 3211, Last => 3223),
      --  681: "keskipäivä"
      681 => (First => 3224, Last => 3233),
      --  682: "kedd"
      682 => (First => 3234, Last => 3237),
      --  683: "ke"
      683 => (First => 3202, Last => 3203),
      --  684: "k"
      684 => (First => 1493, Last => 1493),
      --  685: "június"
      685 => (First => 3238, Last => 3243),
      --  686: "júna"
      686 => (First => 3244, Last => 3247),
      --  687: "jún."
      687 => (First => 3248, Last => 3251),
      --  688: "jún"
      688 => (First => 3238, Last => 3240),
      --  689: "július"
      689 => (First => 3252, Last => 3257),
      --  690: "júla"
      690 => (First => 3258, Last => 3261),
      --  691: "júl."
      691 => (First => 3262, Last => 3265),
      --  692: "júl"
      692 => (First => 3252, Last => 3254),
      --  693: "junio"
      693 => (First => 3266, Last => 3270),
      --  694: "juni"
      694 => (First => 3266, Last => 3269),
      --  695: "junho"
      695 => (First => 3271, Last => 3275),
      --  696: "jun."
      696 => (First => 3276, Last => 3279),
      --  697: "jun"
      697 => (First => 3266, Last => 3268),
      --  698: "julio"
      698 => (First => 3280, Last => 3284),
      --  699: "juli"
      699 => (First => 3280, Last => 3283),
      --  700: "julho"
      700 => (First => 3285, Last => 3289),
      --  701: "jul."
      701 => (First => 3290, Last => 3293),
      --  702: "jul"
      702 => (First => 3280, Last => 3282),
      --  703: "juin"
      703 => (First => 3294, Last => 3297),
      --  704: "juillet"
      704 => (First => 3298, Last => 3304),
      --  705: "juil."
      705 => (First => 3305, Last => 3309),
      --  706: "jueves"
      706 => (First => 3310, Last => 3315),
      --  707: "jue."
      707 => (First => 3316, Last => 3319),
      --  708: "joulukuuta"
      708 => (First => 3320, Last => 3329),
      --  709: "joi"
      709 => (First => 3330, Last => 3332),
      --  710: "jeudi"
      710 => (First => 3333, Last => 3337),
      --  711: "jeu."
      711 => (First => 3338, Last => 3341),
      --  712: "janvier"
      712 => (First => 3342, Last => 3348),
      --  713: "janv."
      713 => (First => 3349, Last => 3353),
      --  714: "januára"
      714 => (First => 3354, Last => 3360),
      --  715: "január"
      715 => (First => 3354, Last => 3359),
      --  716: "januari"
      716 => (First => 3361, Last => 3367),
      --  717: "januar"
      717 => (First => 3361, Last => 3366),
      --  718: "janeiro"
      718 => (First => 3368, Last => 3374),
      --  719: "jan."
      719 => (First => 3375, Last => 3378),
      --  720: "jan"
      720 => (First => 2496, Last => 2498),
      --  721: "ja"
      721 => (First => 2496, Last => 2497),
      --  722: "jKr."
      722 => (First => 3379, Last => 3382),
      --  723: "j"
      723 => (First => 1509, Last => 1509),
      --  724: "iunie"
      724 => (First => 3383, Last => 3387),
      --  725: "iun."
      725 => (First => 3388, Last => 3391),
      --  726: "iulie"
      726 => (First => 3392, Last => 3396),
      --  727: "iul."
      727 => (First => 3397, Last => 3400),
      --  728: "it"
      728 => (First => 1910, Last => 1911),
      --  729: "ip."
      729 => (First => 3401, Last => 3403),
      --  730: "ianuarie"
      730 => (First => 3404, Last => 3411),
      --  731: "ian."
      731 => (First => 3412, Last => 3415),
      --  732: "i. sz."
      732 => (First => 3416, Last => 3421),
      --  733: "i. e."
      733 => (First => 3422, Last => 3426),
      --  734: "hétfő"
      734 => (First => 3427, Last => 3431),
      --  735: "huhtikuuta"
      735 => (First => 3432, Last => 3441),
      --  736: "hu"
      736 => (First => 3432, Last => 3433),
      --  737: "helmikuuta"
      737 => (First => 3442, Last => 3451),
      --  738: "heinäkuuta"
      738 => (First => 3452, Last => 3461),
      --  739: "he"
      739 => (First => 3442, Last => 3443),
      --  740: "h:mm:ss a zzzz"
      740 => (First => 3462, Last => 3475),
      --  741: "h:mm:ss a z"
      741 => (First => 3462, Last => 3472),
      --  742: "h:mm:ss a"
      742 => (First => 3462, Last => 3470),
      --  743: "h:mm a"
      743 => (First => 3476, Last => 3481),
      --  744: "grudnia"
      744 => (First => 3482, Last => 3488),
      --  745: "gru"
      745 => (First => 3482, Last => 3484),
      --  746: "giugno"
      746 => (First => 3489, Last => 3494),
      --  747: "giu"
      747 => (First => 3489, Last => 3491),
      --  748: "giovedì"
      748 => (First => 3495, Last => 3501),
      --  749: "gio"
      749 => (First => 2860, Last => 2862),
      --  750: "gennaio"
      750 => (First => 3502, Last => 3508),
      --  751: "gen"
      751 => (First => 2375, Last => 2377),
      --  752: "ga"
      752 => (First => 3509, Last => 3510),
      --  753: "g"
      753 => (First => 1727, Last => 1727),
      --  754: "février"
      754 => (First => 3511, Last => 3517),
      --  755: "févr."
      755 => (First => 3518, Last => 3522),
      --  756: "fredag"
      756 => (First => 3523, Last => 3528),
      --  757: "fre."
      757 => (First => 3529, Last => 3532),
      --  758: "fre"
      758 => (First => 3523, Last => 3525),
      --  759: "fr"
      759 => (First => 3523, Last => 3524),
      --  760: "fm"
      760 => (First => 3533, Last => 3534),
      --  761: "fi"
      761 => (First => 3535, Last => 3536),
      --  762: "fevereiro"
      762 => (First => 3537, Last => 3545),
      --  763: "fev"
      763 => (First => 3537, Last => 3539),
      --  764: "februára"
      764 => (First => 3546, Last => 3553),
      --  765: "február"
      765 => (First => 3546, Last => 3552),
      --  766: "februarie"
      766 => (First => 3554, Last => 3562),
      --  767: "februari"
      767 => (First => 3554, Last => 3561),
      --  768: "februar"
      768 => (First => 3554, Last => 3560),
      --  769: "febrero"
      769 => (First => 3563, Last => 3569),
      --  770: "febr."
      770 => (First => 3570, Last => 3574),
      --  771: "febbraio"
      771 => (First => 3575, Last => 3582),
      --  772: "feb."
      772 => (First => 3583, Last => 3586),
      --  773: "feb"
      773 => (First => 3546, Last => 3548),
      --  774: "f.Kr."
      774 => (First => 3587, Last => 3591),
      --  775: "f"
      775 => (First => 2050, Last => 2050),
      --  776: "evening"
      776 => (First => 3592, Last => 3598),
      --  777: "es"
      777 => (First => 1932, Last => 1933),
      --  778: "epäluku"
      778 => (First => 3599, Last => 3605),
      --  779: "enero"
      779 => (First => 3606, Last => 3610),
      --  780: "ene."
      780 => (First => 3611, Last => 3614),
      --  781: "en_ZA"
      781 => (First => 3615, Last => 3619),
      --  782: "en_NZ"
      782 => (First => 3620, Last => 3624),
      --  783: "en_IE"
      783 => (First => 3625, Last => 3629),
      --  784: "en_GB"
      784 => (First => 3630, Last => 3634),
      --  785: "en_CA"
      785 => (First => 3635, Last => 3639),
      --  786: "en_AU"
      786 => (First => 3640, Last => 3644),
      --  787: "en"
      787 => (First => 1535, Last => 1536),
      --  788: "em"
      788 => (First => 1873, Last => 1874),
      --  789: "elokuuta"
      789 => (First => 3645, Last => 3652),
      --  790: "el"
      790 => (First => 2437, Last => 2438),
      --  791: "earlyMorning"
      791 => (First => 3653, Last => 3664),
      --  792: "eKr."
      792 => (First => 3665, Last => 3668),
      --  793: "e.Kr."
      793 => (First => 3669, Last => 3673),
      --  794: "e"
      794 => (First => 1523, Last => 1523),
      --  795: "d‏/M‏/y"
      795 => (First => 3674, Last => 3680),
      --  796: "dél"
      796 => (First => 3681, Last => 3683),
      --  797: "décembre"
      797 => (First => 3684, Last => 3691),
      --  798: "déc."
      798 => (First => 3692, Last => 3695),
      --  799: "duminică"
      799 => (First => 3696, Last => 3703),
      --  800: "dubna"
      800 => (First => 3704, Last => 3708),
      --  801: "dub"
      801 => (First => 3704, Last => 3706),
      --  802: "du."
      802 => (First => 3709, Last => 3711),
      --  803: "dopoludnia"
      803 => (First => 3712, Last => 3721),
      --  804: "donderdag"
      804 => (First => 3722, Last => 3730),
      --  805: "domingo"
      805 => (First => 3731, Last => 3737),
      --  806: "domenica"
      806 => (First => 3738, Last => 3745),
      --  807: "dom."
      807 => (First => 3746, Last => 3749),
      --  808: "dom"
      808 => (First => 3731, Last => 3733),
      --  809: "do"
      809 => (First => 2097, Last => 2098),
      --  810: "dinsdag"
      810 => (First => 3750, Last => 3756),
      --  811: "dimanche"
      811 => (First => 3757, Last => 3764),
      --  812: "dim."
      812 => (First => 3765, Last => 3768),
      --  813: "diciembre"
      813 => (First => 3769, Last => 3777),
      --  814: "dicembre"
      814 => (First => 3778, Last => 3785),
      --  815: "dic."
      815 => (First => 3786, Last => 3789),
      --  816: "dic"
      816 => (First => 3769, Last => 3771),
      --  817: "di"
      817 => (First => 1951, Last => 1952),
      --  818: "dezembro"
      818 => (First => 3790, Last => 3797),
      --  819: "dez"
      819 => (First => 3790, Last => 3792),
      --  820: "desember"
      820 => (First => 3798, Last => 3805),
      --  821: "des."
      821 => (First => 3806, Last => 3809),
      --  822: "decembrie"
      822 => (First => 3810, Last => 3818),
      --  823: "decembra"
      823 => (First => 3819, Last => 3826),
      --  824: "december"
      824 => (First => 3827, Last => 3834),
      --  825: "dec."
      825 => (First => 3835, Last => 3838),
      --  826: "dec"
      826 => (First => 3810, Last => 3812),
      --  827: "de."
      827 => (First => 3839, Last => 3841),
      --  828: "de"
      828 => (First => 2058, Last => 2059),
      --  829: "dd‏/MM‏/y"
      829 => (First => 3842, Last => 3850),
      --  830: "dd/MM/yy"
      830 => (First => 3851, Last => 3858),
      --  831: "dd/MM/y"
      831 => (First => 3851, Last => 3857),
      --  832: "dd.MM.yy"
      832 => (First => 3859, Last => 3866),
      --  833: "dd.MM.y"
      833 => (First => 3859, Last => 3865),
      --  834: "dd-MM-yy"
      834 => (First => 3867, Last => 3874),
      --  835: "dd MMMM y"
      835 => (First => 3875, Last => 3883),
      --  836: "dd MMM y"
      836 => (First => 3884, Last => 3891),
      --  837: "da"
      837 => (First => 1502, Last => 1503),
      --  838: "dC"
      838 => (First => 3892, Last => 3893),
      --  839: "d/MM/yy"
      839 => (First => 3852, Last => 3858),
      --  840: "d/MM/y"
      840 => (First => 3852, Last => 3857),
      --  841: "d/M/yy"
      841 => (First => 3894, Last => 3899),
      --  842: "d.MM.y"
      842 => (First => 3860, Last => 3865),
      --  843: "d.M.y"
      843 => (First => 3900, Last => 3904),
      --  844: "d.Hr."
      844 => (First => 3905, Last => 3909),
      --  845: "d.C."
      845 => (First => 3910, Last => 3913),
      --  846: "d. MMMM y"
      846 => (First => 3914, Last => 3922),
      --  847: "d. MMM y"
      847 => (First => 3923, Last => 3930),
      --  848: "d. M. y"
      848 => (First => 3931, Last => 3937),
      --  849: "d. C."
      849 => (First => 3938, Last => 3942),
      --  850: "d בMMMM y"
      850 => (First => 3943, Last => 3951),
      --  851: "d בMMM y"
      851 => (First => 3952, Last => 3959),
      --  852: "d MMMM، y"
      852 => (First => 3960, Last => 3968),
      --  853: "d MMMM y EEEE"
      853 => (First => 3969, Last => 3981),
      --  854: "d MMMM y 'г'."
      854 => (First => 3982, Last => 3994),
      --  855: "d MMMM y"
      855 => (First => 3876, Last => 3883),
      --  856: "d MMMM G y"
      856 => (First => 3995, Last => 4004),
      --  857: "d MMM y 'г'."
      857 => (First => 4005, Last => 4016),
      --  858: "d MMM y"
      858 => (First => 3885, Last => 3891),
      --  859: "d 'de' MMMM 'de' y"
      859 => (First => 4017, Last => 4034),
      --  860: "d 'de' MMM 'de' y"
      860 => (First => 4035, Last => 4051),
      --  861: "d"
      861 => (First => 1502, Last => 1502),
      --  862: "czwartek"
      862 => (First => 4052, Last => 4059),
      --  863: "czw."
      863 => (First => 4060, Last => 4063),
      --  864: "czerwca"
      864 => (First => 4064, Last => 4070),
      --  865: "cze"
      865 => (First => 4064, Last => 4066),
      --  866: "csütörtök"
      866 => (First => 4071, Last => 4079),
      --  867: "cs"
      867 => (First => 4071, Last => 4072),
      --  868: "cccc d. MMMM y"
      868 => (First => 4080, Last => 4093),
      --  869: "c"
      869 => (First => 1517, Last => 1517),
      --  870: "března"
      870 => (First => 4094, Last => 4099),
      --  871: "bře"
      871 => (First => 4094, Last => 4096),
      --  872: "avril"
      872 => (First => 4100, Last => 4104),
      --  873: "avr."
      873 => (First => 4105, Last => 4108),
      --  874: "av. J.-C."
      874 => (First => 4109, Last => 4117),
      --  875: "augusztus"
      875 => (First => 4118, Last => 4126),
      --  876: "augustus"
      876 => (First => 4127, Last => 4134),
      --  877: "augusti"
      877 => (First => 4135, Last => 4141),
      --  878: "augusta"
      878 => (First => 4142, Last => 4148),
      --  879: "august"
      879 => (First => 4127, Last => 4132),
      --  880: "aug."
      880 => (First => 4149, Last => 4152),
      --  881: "aug"
      881 => (First => 4118, Last => 4120),
      --  882: "arab"
      882 => (First => 4153, Last => 4156),
      --  883: "ar"
      883 => (First => 1578, Last => 1579),
      --  884: "apríla"
      884 => (First => 4157, Last => 4162),
      --  885: "après-midi"
      885 => (First => 4163, Last => 4172),
      --  886: "aprilie"
      886 => (First => 4173, Last => 4179),
      --  887: "aprile"
      887 => (First => 4180, Last => 4185),
      --  888: "april"
      888 => (First => 4173, Last => 4177),
      --  889: "apr."
      889 => (First => 4186, Last => 4189),
      --  890: "apr"
      890 => (First => 4157, Last => 4159),
      --  891: "ap. J.-C."
      891 => (First => 4190, Last => 4198),
      --  892: "ap."
      892 => (First => 2515, Last => 2517),
      --  893: "août"
      893 => (First => 4199, Last => 4202),
      --  894: "am"
      894 => (First => 1581, Last => 1582),
      --  895: "ah:mm:ss [zzzz]"
      895 => (First => 4203, Last => 4217),
      --  896: "ah:mm:ss [z]"
      896 => (First => 4218, Last => 4229),
      --  897: "ah:mm:ss"
      897 => (First => 1714, Last => 1721),
      --  898: "ah:mm"
      898 => (First => 1714, Last => 1718),
      --  899: "agosto"
      899 => (First => 4230, Last => 4235),
      --  900: "ago."
      900 => (First => 4236, Last => 4239),
      --  901: "ago"
      901 => (First => 2549, Last => 2551),
      --  902: "afternoon"
      902 => (First => 4240, Last => 4248),
      --  903: "abril"
      903 => (First => 4249, Last => 4253),
      --  904: "abr."
      904 => (First => 4254, Last => 4257),
      --  905: "abr"
      905 => (First => 4249, Last => 4251),
      --  906: "abends"
      906 => (First => 4258, Last => 4263),
      --  907: "aC"
      907 => (First => 4264, Last => 4265),
      --  908: "a.m."
      908 => (First => 4266, Last => 4269),
      --  909: "a.C."
      909 => (First => 4270, Last => 4273),
      --  910: "a. m."
      910 => (First => 4274, Last => 4278),
      --  911: "a. C."
      911 => (First => 4279, Last => 4283),
      --  912: "a h시 m분 s초 zzzz"
      912 => (First => 4284, Last => 4298),
      --  913: "a h시 m분 s초 z"
      913 => (First => 4284, Last => 4295),
      --  914: "a h:mm:ss"
      914 => (First => 4299, Last => 4307),
      --  915: "a h:mm"
      915 => (First => 4299, Last => 4304),
      --  916: "a"
      916 => (First => 1497, Last => 1497),
      --  917: "Wednesday"
      917 => (First => 4308, Last => 4316),
      --  918: "Wed"
      918 => (First => 4308, Last => 4310),
      --  919: "Vin"
      919 => (First => 4317, Last => 4319),
      --  920: "V"
      920 => (First => 4317, Last => 4317),
      --  921: "Tuesday"
      921 => (First => 4320, Last => 4326),
      --  922: "Tue"
      922 => (First => 4320, Last => 4322),
      --  923: "Thursday"
      923 => (First => 4327, Last => 4334),
      --  924: "Thu"
      924 => (First => 4327, Last => 4329),
      --  925: "Temmuz"
      925 => (First => 4335, Last => 4340),
      --  926: "Tem"
      926 => (First => 4335, Last => 4337),
      --  927: "T"
      927 => (First => 4320, Last => 4320),
      --  928: "Sâm"
      928 => (First => 4341, Last => 4343),
      --  929: "Szo"
      929 => (First => 4344, Last => 4346),
      --  930: "Sze"
      930 => (First => 4347, Last => 4349),
      --  931: "Sz"
      931 => (First => 4344, Last => 4345),
      --  932: "Sunday"
      932 => (First => 4350, Last => 4355),
      --  933: "Sun"
      933 => (First => 4350, Last => 4352),
      --  934: "Sonntag"
      934 => (First => 4356, Last => 4362),
      --  935: "So."
      935 => (First => 4363, Last => 4365),
      --  936: "September"
      936 => (First => 4366, Last => 4374),
      --  937: "Sep."
      937 => (First => 4375, Last => 4378),
      --  938: "Sep"
      938 => (First => 4366, Last => 4368),
      --  939: "Saturday"
      939 => (First => 4379, Last => 4386),
      --  940: "Sath"
      940 => (First => 4387, Last => 4390),
      --  941: "Sat"
      941 => (First => 4379, Last => 4381),
      --  942: "Samstag"
      942 => (First => 4391, Last => 4397),
      --  943: "Samhain"
      943 => (First => 4398, Last => 4404),
      --  944: "Samh"
      944 => (First => 4398, Last => 4401),
      --  945: "Salı"
      945 => (First => 4405, Last => 4408),
      --  946: "Sal"
      946 => (First => 4405, Last => 4407),
      --  947: "Sa."
      947 => (First => 4409, Last => 4411),
      --  948: "S"
      948 => (First => 1576, Last => 1576),
      --  949: "RC"
      949 => (First => 4412, Last => 4413),
      --  950: "Pzt"
      950 => (First => 4414, Last => 4416),
      --  951: "Perşembe"
      951 => (First => 4417, Last => 4424),
      --  952: "Per"
      952 => (First => 4417, Last => 4419),
      --  953: "Pazartesi"
      953 => (First => 4425, Last => 4433),
      --  954: "Pazar"
      954 => (First => 4425, Last => 4429),
      --  955: "Paz"
      955 => (First => 4425, Last => 4427),
      --  956: "PM"
      956 => (First => 4434, Last => 4435),
      --  957: "P"
      957 => (First => 4414, Last => 4414),
      --  958: "Oktober"
      958 => (First => 4436, Last => 4442),
      --  959: "Okt."
      959 => (First => 4443, Last => 4446),
      --  960: "October"
      960 => (First => 4447, Last => 4453),
      --  961: "Oct"
      961 => (First => 4447, Last => 4449),
      --  962: "Ocak"
      962 => (First => 4454, Last => 4457),
      --  963: "Oca"
      963 => (First => 4454, Last => 4456),
      --  964: "O"
      964 => (First => 4436, Last => 4436),
      --  965: "November"
      965 => (First => 4458, Last => 4465),
      --  966: "Nov."
      966 => (First => 4466, Last => 4469),
      --  967: "Nov"
      967 => (First => 4458, Last => 4460),
      --  968: "Nollaig"
      968 => (First => 4470, Last => 4476),
      --  969: "Noll"
      969 => (First => 4470, Last => 4473),
      --  970: "Nisan"
      970 => (First => 4477, Last => 4481),
      --  971: "Nis"
      971 => (First => 4477, Last => 4479),
      --  972: "NaN"
      972 => (First => 4482, Last => 4484),
      --  973: "N"
      973 => (First => 3623, Last => 3623),
      --  974: "März"
      974 => (First => 4485, Last => 4488),
      --  975: "Márta"
      975 => (First => 4489, Last => 4493),
      --  976: "Máirt"
      976 => (First => 4494, Last => 4498),
      --  977: "MÖ"
      977 => (First => 4499, Last => 4500),
      --  978: "Montag"
      978 => (First => 4501, Last => 4506),
      --  979: "Monday"
      979 => (First => 4507, Last => 4512),
      --  980: "Mon"
      980 => (First => 4501, Last => 4503),
      --  981: "Mo."
      981 => (First => 4513, Last => 4515),
      --  982: "Mittwoch"
      982 => (First => 4516, Last => 4523),
      --  983: "Mittag"
      983 => (First => 4524, Last => 4529),
      --  984: "Mie"
      984 => (First => 4530, Last => 4532),
      --  985: "Mi."
      985 => (First => 4533, Last => 4535),
      --  986: "Meán Fómhair"
      986 => (First => 4536, Last => 4547),
      --  987: "Meitheamh"
      987 => (First => 4548, Last => 4556),
      --  988: "Meith"
      988 => (First => 4548, Last => 4552),
      --  989: "Mayıs"
      989 => (First => 4557, Last => 4561),
      --  990: "May"
      990 => (First => 4557, Last => 4559),
      --  991: "Mart"
      991 => (First => 4562, Last => 4565),
      --  992: "March"
      992 => (First => 4566, Last => 4570),
      --  993: "Mar"
      993 => (First => 4562, Last => 4564),
      --  994: "Mai"
      994 => (First => 4571, Last => 4573),
      --  995: "MS"
      995 => (First => 4574, Last => 4575),
      --  996: "MMMM d, y"
      996 => (First => 4576, Last => 4584),
      --  997: "MMM d, y"
      997 => (First => 4577, Last => 4584),
      --  998: "MFómh"
      998 => (First => 4585, Last => 4589),
      --  999: "M/d/yy"
      999 => (First => 4590, Last => 4595),
      --  1000: "M"
      1000 => (First => 1746, Last => 1746),
      --  1001: "Lúnasa"
      1001 => (First => 4596, Last => 4601),
      --  1002: "Lún"
      1002 => (First => 4596, Last => 4598),
      --  1003: "Lun"
      1003 => (First => 4602, Last => 4604),
      --  1004: "Luan"
      1004 => (First => 4605, Last => 4608),
      --  1005: "L"
      1005 => (First => 4596, Last => 4596),
      --  1006: "Kasım"
      1006 => (First => 4609, Last => 4613),
      --  1007: "Kas"
      1007 => (First => 4609, Last => 4611),
      --  1008: "K"
      1008 => (First => 2411, Last => 2411),
      --  1009: "Juni"
      1009 => (First => 4614, Last => 4617),
      --  1010: "June"
      1010 => (First => 4618, Last => 4621),
      --  1011: "Jun"
      1011 => (First => 4614, Last => 4616),
      --  1012: "July"
      1012 => (First => 4622, Last => 4625),
      --  1013: "Juli"
      1013 => (First => 4626, Last => 4629),
      --  1014: "Jul"
      1014 => (First => 4622, Last => 4624),
      --  1015: "Joi"
      1015 => (First => 4630, Last => 4632),
      --  1016: "January"
      1016 => (First => 4633, Last => 4639),
      --  1017: "Januar"
      1017 => (First => 4633, Last => 4638),
      --  1018: "Jan."
      1018 => (First => 4640, Last => 4643),
      --  1019: "Jan"
      1019 => (First => 4633, Last => 4635),
      --  1020: "J"
      1020 => (First => 4113, Last => 4113),
      --  1021: "Iúil"
      1021 => (First => 4644, Last => 4647),
      --  1022: "Inf"
      1022 => (First => 4648, Last => 4650),
      --  1023: "I"
      1023 => (First => 3628, Last => 3628),
      --  1024: "H時mm分ss秒 zzzz"
      1024 => (First => 4651, Last => 4663),
      --  1025: "Haziran"
      1025 => (First => 4664, Last => 4670),
      --  1026: "Haz"
      1026 => (First => 4664, Last => 4666),
      --  1027: "HH:mm:ss zzzz"
      1027 => (First => 4671, Last => 4683),
      --  1028: "HH:mm:ss z"
      1028 => (First => 4671, Last => 4680),
      --  1029: "HH:mm:ss"
      1029 => (First => 4671, Last => 4678),
      --  1030: "HH:mm"
      1030 => (First => 4671, Last => 4675),
      --  1031: "HH.mm.ss zzzz"
      1031 => (First => 4684, Last => 4696),
      --  1032: "HH.mm.ss z"
      1032 => (First => 4684, Last => 4693),
      --  1033: "HH.mm.ss"
      1033 => (First => 4684, Last => 4691),
      --  1034: "HH.mm"
      1034 => (First => 4684, Last => 4688),
      --  1035: "H:mm:ss zzzz"
      1035 => (First => 4672, Last => 4683),
      --  1036: "H:mm:ss z"
      1036 => (First => 4672, Last => 4680),
      --  1037: "H:mm:ss (zzzz)"
      1037 => (First => 4697, Last => 4710),
      --  1038: "H:mm:ss"
      1038 => (First => 4672, Last => 4678),
      --  1039: "H:mm"
      1039 => (First => 4672, Last => 4675),
      --  1040: "H.mm.ss zzzz"
      1040 => (First => 4685, Last => 4696),
      --  1041: "H.mm.ss z"
      1041 => (First => 4685, Last => 4693),
      --  1042: "H.mm.ss"
      1042 => (First => 4685, Last => 4691),
      --  1043: "H.mm"
      1043 => (First => 4685, Last => 4688),
      --  1044: "H นาฬิกา mm นาที ss วินาที zzzz"
      1044 => (First => 4711, Last => 4741),
      --  1045: "H นาฬิกา mm นาที ss วินาที z"
      1045 => (First => 4711, Last => 4738),
      --  1046: "H"
      1046 => (First => 1555, Last => 1555),
      --  1047: "G"
      1047 => (First => 3633, Last => 3633),
      --  1048: "Friday"
      1048 => (First => 4742, Last => 4747),
      --  1049: "Fri"
      1049 => (First => 4742, Last => 4744),
      --  1050: "Freitag"
      1050 => (First => 4748, Last => 4754),
      --  1051: "Fr."
      1051 => (First => 4755, Last => 4757),
      --  1052: "February"
      1052 => (First => 4758, Last => 4765),
      --  1053: "Februar"
      1053 => (First => 4758, Last => 4764),
      --  1054: "Feb."
      1054 => (First => 4766, Last => 4769),
      --  1055: "Feb"
      1055 => (First => 4758, Last => 4760),
      --  1056: "Feabhra"
      1056 => (First => 4770, Last => 4776),
      --  1057: "Feabh"
      1057 => (First => 4770, Last => 4774),
      --  1058: "F"
      1058 => (First => 4541, Last => 4541),
      --  1059: "Eylül"
      1059 => (First => 4777, Last => 4781),
      --  1060: "Eyl"
      1060 => (First => 4777, Last => 4779),
      --  1061: "Ekim"
      1061 => (First => 4782, Last => 4785),
      --  1062: "Eki"
      1062 => (First => 4782, Last => 4784),
      --  1063: "Eanáir"
      1063 => (First => 4786, Last => 4791),
      --  1064: "Ean"
      1064 => (First => 4786, Last => 4788),
      --  1065: "EEEEที่ d MMMM G y"
      1065 => (First => 4792, Last => 4809),
      --  1066: "EEEE، d MMMM، y"
      1066 => (First => 4810, Last => 4824),
      --  1067: "EEEE, d. MMMM y"
      1067 => (First => 4825, Last => 4839),
      --  1068: "EEEE, d בMMMM y"
      1068 => (First => 4840, Last => 4854),
      --  1069: "EEEE, d MMMM y 'г'."
      1069 => (First => 4855, Last => 4873),
      --  1070: "EEEE, d MMMM y"
      1070 => (First => 4855, Last => 4868),
      --  1071: "EEEE, d 'de' MMMM 'de' y"
      1071 => (First => 4874, Last => 4897),
      --  1072: "EEEE, MMMM d, y"
      1072 => (First => 4898, Last => 4912),
      --  1073: "EEEE dd MMMM y"
      1073 => (First => 4913, Last => 4926),
      --  1074: "EEEE d. MMMM y"
      1074 => (First => 4927, Last => 4940),
      --  1075: "EEEE d MMMM y"
      1075 => (First => 4941, Last => 4953),
      --  1076: "EEEE 'den' d. MMMM y"
      1076 => (First => 4954, Last => 4973),
      --  1077: "E"
      1077 => (First => 1752, Last => 1752),
      --  1078: "Déardaoin"
      1078 => (First => 4974, Last => 4982),
      --  1079: "Déar"
      1079 => (First => 4974, Last => 4977),
      --  1080: "Dé hAoine"
      1080 => (First => 4983, Last => 4991),
      --  1081: "Dé Sathairn"
      1081 => (First => 4992, Last => 5002),
      --  1082: "Dé Máirt"
      1082 => (First => 5003, Last => 5010),
      --  1083: "Dé Luain"
      1083 => (First => 5011, Last => 5018),
      --  1084: "Dé Domhnaigh"
      1084 => (First => 5019, Last => 5030),
      --  1085: "Dé Céadaoin"
      1085 => (First => 5031, Last => 5041),
      --  1086: "Dum"
      1086 => (First => 5042, Last => 5044),
      --  1087: "Donnerstag"
      1087 => (First => 5045, Last => 5054),
      --  1088: "Domh"
      1088 => (First => 5022, Last => 5025),
      --  1089: "Do."
      1089 => (First => 5055, Last => 5057),
      --  1090: "Dienstag"
      1090 => (First => 5058, Last => 5065),
      --  1091: "Di."
      1091 => (First => 5066, Last => 5068),
      --  1092: "Dezember"
      1092 => (First => 5069, Last => 5076),
      --  1093: "Dez."
      1093 => (First => 5077, Last => 5080),
      --  1094: "Deireadh Fómhair"
      1094 => (First => 5081, Last => 5096),
      --  1095: "December"
      1095 => (First => 5097, Last => 5104),
      --  1096: "Dec"
      1096 => (First => 5097, Last => 5099),
      --  1097: "DFómh"
      1097 => (First => 5105, Last => 5109),
      --  1098: "D"
      1098 => (First => 2844, Last => 2844),
      --  1099: "Céad"
      1099 => (First => 5034, Last => 5037),
      --  1100: "Cumartesi"
      1100 => (First => 5110, Last => 5118),
      --  1101: "Cuma"
      1101 => (First => 5110, Last => 5113),
      --  1102: "Cum"
      1102 => (First => 5110, Last => 5112),
      --  1103: "Cs"
      1103 => (First => 5119, Last => 5120),
      --  1104: "Cmt"
      1104 => (First => 5121, Last => 5123),
      --  1105: "CE"
      1105 => (First => 5124, Last => 5125),
      --  1106: "Bealtaine"
      1106 => (First => 5126, Last => 5134),
      --  1107: "Beal"
      1107 => (First => 5126, Last => 5129),
      --  1108: "BCE"
      1108 => (First => 5135, Last => 5137),
      --  1109: "BC"
      1109 => (First => 5135, Last => 5136),
      --  1110: "B"
      1110 => (First => 3634, Last => 3634),
      --  1111: "Ağustos"
      1111 => (First => 5138, Last => 5144),
      --  1112: "Ağu"
      1112 => (First => 5138, Last => 5140),
      --  1113: "August"
      1113 => (First => 5145, Last => 5150),
      --  1114: "Aug."
      1114 => (First => 5151, Last => 5154),
      --  1115: "Aug"
      1115 => (First => 5145, Last => 5147),
      --  1116: "Aralık"
      1116 => (First => 5155, Last => 5160),
      --  1117: "Ara"
      1117 => (First => 5155, Last => 5157),
      --  1118: "April"
      1118 => (First => 5161, Last => 5165),
      --  1119: "Apr."
      1119 => (First => 5166, Last => 5169),
      --  1120: "Apr"
      1120 => (First => 5161, Last => 5163),
      --  1121: "Aoine"
      1121 => (First => 4987, Last => 4991),
      --  1122: "Aibreán"
      1122 => (First => 5170, Last => 5176),
      --  1123: "Aib"
      1123 => (First => 5170, Last => 5172),
      --  1124: "AM"
      1124 => (First => 5177, Last => 5178),
      --  1125: "AD"
      1125 => (First => 5179, Last => 5180),
      --  1126: "A"
      1126 => (First => 3619, Last => 3619),
      --  1127: ";"
      1127 => (First => 1599, Last => 1599),
      --  1128: "9월"
      1128 => (First => 5181, Last => 5182),
      --  1129: "9月"
      1129 => (First => 5183, Last => 5184),
      --  1130: "9"
      1130 => (First => 170, Last => 170),
      --  1131: "8월"
      1131 => (First => 5185, Last => 5186),
      --  1132: "8月"
      1132 => (First => 5187, Last => 5188),
      --  1133: "8"
      1133 => (First => 169, Last => 169),
      --  1134: "7월"
      1134 => (First => 5189, Last => 5190),
      --  1135: "7月"
      1135 => (First => 5191, Last => 5192),
      --  1136: "7"
      1136 => (First => 168, Last => 168),
      --  1137: "6월"
      1137 => (First => 5193, Last => 5194),
      --  1138: "6月"
      1138 => (First => 5195, Last => 5196),
      --  1139: "6"
      1139 => (First => 167, Last => 167),
      --  1140: "5월"
      1140 => (First => 5197, Last => 5198),
      --  1141: "5月"
      1141 => (First => 5199, Last => 5200),
      --  1142: "5"
      1142 => (First => 166, Last => 166),
      --  1143: "4월"
      1143 => (First => 5201, Last => 5202),
      --  1144: "4月"
      1144 => (First => 5203, Last => 5204),
      --  1145: "4"
      1145 => (First => 165, Last => 165),
      --  1146: "3월"
      1146 => (First => 5205, Last => 5206),
      --  1147: "3月"
      1147 => (First => 5207, Last => 5208),
      --  1148: "3"
      1148 => (First => 164, Last => 164),
      --  1149: "2월"
      1149 => (First => 5209, Last => 5210),
      --  1150: "2月"
      1150 => (First => 5211, Last => 5212),
      --  1151: "2"
      1151 => (First => 163, Last => 163),
      --  1152: "1월"
      1152 => (First => 5213, Last => 5214),
      --  1153: "1月"
      1153 => (First => 5215, Last => 5216),
      --  1154: "12월"
      1154 => (First => 5217, Last => 5219),
      --  1155: "12月"
      1155 => (First => 5220, Last => 5222),
      --  1156: "12 uur ‘s middags"
      1156 => (First => 5223, Last => 5239),
      --  1157: "12"
      1157 => (First => 162, Last => 163),
      --  1158: "11월"
      1158 => (First => 5240, Last => 5242),
      --  1159: "11月"
      1159 => (First => 5243, Last => 5245),
      --  1160: "11"
      1160 => (First => 5240, Last => 5241),
      --  1161: "10월"
      1161 => (First => 5246, Last => 5248),
      --  1162: "10月"
      1162 => (First => 5249, Last => 5251),
      --  1163: "10"
      1163 => (First => 1570, Last => 1571),
      --  1164: "1"
      1164 => (First => 162, Last => 162),
      --  1165: "0"
      1165 => (First => 161, Last => 161),
      --  1166: "."
      1166 => (First => 532, Last => 532),
      --  1167: "-"
      1167 => (First => 521, Last => 521),
      --  1168: ","
      1168 => (First => 1592, Last => 1592),
      --  1169: "+"
      1169 => (First => 523, Last => 523),
      --  1170: "'kl'. HH:mm:ss zzzz"
      1170 => (First => 5252, Last => 5270),
      --  1171: "%#,##0"
      1171 => (First => 5271, Last => 5276),
      --  1172: "%"
      1172 => (First => 5271, Last => 5271),
      --  1173: "#E0"
      1173 => (First => 5277, Last => 5279),
      --  1174: "#,##0 %"
      1174 => (First => 5280, Last => 5286),
      --  1175: "#,##0.00 ¤;(#,##0.00 ¤)"
      1175 => (First => 5287, Last => 5309),
      --  1176: "#,##0.00 ¤"
      1176 => (First => 5287, Last => 5296),
      --  1177: "#,##0.###"
      1177 => (First => 5310, Last => 5318),
      --  1178: "#,##0%"
      1178 => (First => 5319, Last => 5324),
      --  1179: "#"
      1179 => (First => 1591, Last => 1591));

begin
   return Result;
end String_Addresses;
